<?php declare(strict_types=1);

return array (
  0 => 
  array (
    'code' => 1095,
    'city' => 'Абакан',
  ),
  1 => 
  array (
    'code' => 20273,
    'city' => 'Актобе',
  ),
  2 => 
  array (
    'code' => 10656,
    'city' => 'Александров',
  ),
  3 => 
  array (
    'code' => 11471,
    'city' => 'Алушта',
  ),
  4 => 
  array (
    'code' => 11121,
    'city' => 'Альметьевск',
  ),
  5 => 
  array (
    'code' => 11458,
    'city' => 'Анадырь',
  ),
  6 => 
  array (
    'code' => 1107,
    'city' => 'Анапа',
  ),
  7 => 
  array (
    'code' => 11256,
    'city' => 'Ангарск',
  ),
  8 => 
  array (
    'code' => 10894,
    'city' => 'Апатиты',
  ),
  9 => 
  array (
    'code' => 11080,
    'city' => 'Арзамас',
  ),
  10 => 
  array (
    'code' => 10987,
    'city' => 'Армавир',
  ),
  11 => 
  array (
    'code' => 20,
    'city' => 'Архангельск',
  ),
  12 => 
  array (
    'code' => 37,
    'city' => 'Астрахань',
  ),
  13 => 
  array (
    'code' => 11302,
    'city' => 'Ачинск',
  ),
  14 => 
  array (
    'code' => 11143,
    'city' => 'Балаково',
  ),
  15 => 
  array (
    'code' => 10716,
    'city' => 'Балашиха',
  ),
  16 => 
  array (
    'code' => 197,
    'city' => 'Барнаул',
  ),
  17 => 
  array (
    'code' => 10369,
    'city' => 'Белая Церковь',
  ),
  18 => 
  array (
    'code' => 4,
    'city' => 'Белгород',
  ),
  19 => 
  array (
    'code' => 11374,
    'city' => 'Белогорск',
  ),
  20 => 
  array (
    'code' => 11314,
    'city' => 'Бердск',
  ),
  21 => 
  array (
    'code' => 975,
    'city' => 'Бийск',
  ),
  22 => 
  array (
    'code' => 11393,
    'city' => 'Биробиджан',
  ),
  23 => 
  array (
    'code' => 77,
    'city' => 'Благовещенск',
  ),
  24 => 
  array (
    'code' => 976,
    'city' => 'Братск',
  ),
  25 => 
  array (
    'code' => 153,
    'city' => 'Брест',
  ),
  26 => 
  array (
    'code' => 191,
    'city' => 'Брянск',
  ),
  27 => 
  array (
    'code' => 11122,
    'city' => 'Бугульма',
  ),
  28 => 
  array (
    'code' => 10928,
    'city' => 'Великие Луки',
  ),
  29 => 
  array (
    'code' => 24,
    'city' => 'Великий Новгород',
  ),
  30 => 
  array (
    'code' => 10719,
    'city' => 'Видное',
  ),
  31 => 
  array (
    'code' => 75,
    'city' => 'Владивосток',
  ),
  32 => 
  array (
    'code' => 192,
    'city' => 'Владимир',
  ),
  33 => 
  array (
    'code' => 38,
    'city' => 'Волгоград',
  ),
  34 => 
  array (
    'code' => 11036,
    'city' => 'Волгодонск',
  ),
  35 => 
  array (
    'code' => 10951,
    'city' => 'Волжский',
  ),
  36 => 
  array (
    'code' => 21,
    'city' => 'Вологда',
  ),
  37 => 
  array (
    'code' => 193,
    'city' => 'Воронеж',
  ),
  38 => 
  array (
    'code' => 969,
    'city' => 'Выборг',
  ),
  39 => 
  array (
    'code' => 20040,
    'city' => 'Выкса',
  ),
  40 => 
  array (
    'code' => 10867,
    'city' => 'Гатчина',
  ),
  41 => 
  array (
    'code' => 10990,
    'city' => 'Геленджик',
  ),
  42 => 
  array (
    'code' => 11150,
    'city' => 'Глазов',
  ),
  43 => 
  array (
    'code' => 11319,
    'city' => 'Горно-Алтайск',
  ),
  44 => 
  array (
    'code' => 1106,
    'city' => 'Грозный',
  ),
  45 => 
  array (
    'code' => 10661,
    'city' => 'Гусь-Хрустальный',
  ),
  46 => 
  array (
    'code' => 73,
    'city' => 'Дальний Восток',
  ),
  47 => 
  array (
    'code' => 972,
    'city' => 'Дзержинск',
  ),
  48 => 
  array (
    'code' => 11155,
    'city' => 'Димитровград',
  ),
  49 => 
  array (
    'code' => 10723,
    'city' => 'Дмитров',
  ),
  50 => 
  array (
    'code' => 141,
    'city' => 'Днепропетровск',
  ),
  51 => 
  array (
    'code' => 214,
    'city' => 'Долгопрудный',
  ),
  52 => 
  array (
    'code' => 10725,
    'city' => 'Домодедово',
  ),
  53 => 
  array (
    'code' => 215,
    'city' => 'Дубна',
  ),
  54 => 
  array (
    'code' => 11463,
    'city' => 'Евпатория',
  ),
  55 => 
  array (
    'code' => 10993,
    'city' => 'Ейск',
  ),
  56 => 
  array (
    'code' => 54,
    'city' => 'Екатеринбург',
  ),
  57 => 
  array (
    'code' => 11123,
    'city' => 'Елабуга',
  ),
  58 => 
  array (
    'code' => 11057,
    'city' => 'Ессентуки',
  ),
  59 => 
  array (
    'code' => 20086,
    'city' => 'Железногорск',
  ),
  60 => 
  array (
    'code' => 21622,
    'city' => 'Железнодорожный',
  ),
  61 => 
  array (
    'code' => 11132,
    'city' => 'Жигулевск',
  ),
  62 => 
  array (
    'code' => 20571,
    'city' => 'Жуковский',
  ),
  63 => 
  array (
    'code' => 216,
    'city' => 'Зеленоград',
  ),
  64 => 
  array (
    'code' => 11125,
    'city' => 'Зеленодольск',
  ),
  65 => 
  array (
    'code' => 11202,
    'city' => 'Златоуст',
  ),
  66 => 
  array (
    'code' => 5,
    'city' => 'Иваново',
  ),
  67 => 
  array (
    'code' => 44,
    'city' => 'Ижевск',
  ),
  68 => 
  array (
    'code' => 41,
    'city' => 'Йошкар-Ола',
  ),
  69 => 
  array (
    'code' => 63,
    'city' => 'Иркутск',
  ),
  70 => 
  array (
    'code' => 11173,
    'city' => 'Ишим',
  ),
  71 => 
  array (
    'code' => 43,
    'city' => 'Казань',
  ),
  72 => 
  array (
    'code' => 22,
    'city' => 'Калининград',
  ),
  73 => 
  array (
    'code' => 6,
    'city' => 'Калуга',
  ),
  74 => 
  array (
    'code' => 11043,
    'city' => 'Каменск-Шахтинский',
  ),
  75 => 
  array (
    'code' => 64,
    'city' => 'Кемерово',
  ),
  76 => 
  array (
    'code' => 11464,
    'city' => 'Керчь',
  ),
  77 => 
  array (
    'code' => 46,
    'city' => 'Киров',
  ),
  78 => 
  array (
    'code' => 20221,
    'city' => 'Кировоград',
  ),
  79 => 
  array (
    'code' => 11071,
    'city' => 'Кирово-Чепецк',
  ),
  80 => 
  array (
    'code' => 11062,
    'city' => 'Кисловодск',
  ),
  81 => 
  array (
    'code' => 10733,
    'city' => 'Клин',
  ),
  82 => 
  array (
    'code' => 10664,
    'city' => 'Ковров',
  ),
  83 => 
  array (
    'code' => 10734,
    'city' => 'Коломна',
  ),
  84 => 
  array (
    'code' => 11453,
    'city' => 'Комсомольск-на-Амуре',
  ),
  85 => 
  array (
    'code' => 20728,
    'city' => 'Королёв',
  ),
  86 => 
  array (
    'code' => 7,
    'city' => 'Кострома',
  ),
  87 => 
  array (
    'code' => 10735,
    'city' => 'Красногорск',
  ),
  88 => 
  array (
    'code' => 35,
    'city' => 'Краснодар',
  ),
  89 => 
  array (
    'code' => 62,
    'city' => 'Красноярск',
  ),
  90 => 
  array (
    'code' => 21609,
    'city' => 'Кременчуг',
  ),
  91 => 
  array (
    'code' => 10347,
    'city' => 'Кривой Рог',
  ),
  92 => 
  array (
    'code' => 20044,
    'city' => 'Кстово',
  ),
  93 => 
  array (
    'code' => 53,
    'city' => 'Курган',
  ),
  94 => 
  array (
    'code' => 8,
    'city' => 'Курск',
  ),
  95 => 
  array (
    'code' => 11333,
    'city' => 'Кызыл',
  ),
  96 => 
  array (
    'code' => 9,
    'city' => 'Липецк',
  ),
  97 => 
  array (
    'code' => 10738,
    'city' => 'Люберцы',
  ),
  98 => 
  array (
    'code' => 79,
    'city' => 'Магадан',
  ),
  99 => 
  array (
    'code' => 235,
    'city' => 'Магнитогорск',
  ),
  100 => 
  array (
    'code' => 1093,
    'city' => 'Майкоп',
  ),
  101 => 
  array (
    'code' => 24876,
    'city' => 'Макеевка',
  ),
  102 => 
  array (
    'code' => 10366,
    'city' => 'Мариуполь',
  ),
  103 => 
  array (
    'code' => 28,
    'city' => 'Махачкала',
  ),
  104 => 
  array (
    'code' => 11287,
    'city' => 'Междуреченск',
  ),
  105 => 
  array (
    'code' => 10367,
    'city' => 'Мелитополь',
  ),
  106 => 
  array (
    'code' => 11212,
    'city' => 'Миасс',
  ),
  107 => 
  array (
    'code' => 11063,
    'city' => 'Минеральные Воды',
  ),
  108 => 
  array (
    'code' => 158,
    'city' => 'Могилев',
  ),
  109 => 
  array (
    'code' => 213,
    'city' => 'Москва',
  ),
  110 => 
  array (
    'code' => 23,
    'city' => 'Мурманск',
  ),
  111 => 
  array (
    'code' => 10668,
    'city' => 'Муром',
  ),
  112 => 
  array (
    'code' => 10740,
    'city' => 'Мытищи',
  ),
  113 => 
  array (
    'code' => 236,
    'city' => 'Набережные Челны',
  ),
  114 => 
  array (
    'code' => 1092,
    'city' => 'Назрань',
  ),
  115 => 
  array (
    'code' => 30,
    'city' => 'Нальчик',
  ),
  116 => 
  array (
    'code' => 974,
    'city' => 'Находка',
  ),
  117 => 
  array (
    'code' => 11064,
    'city' => 'Невинномысск',
  ),
  118 => 
  array (
    'code' => 11114,
    'city' => 'Нефтекамск',
  ),
  119 => 
  array (
    'code' => 1091,
    'city' => 'Нижневартовск',
  ),
  120 => 
  array (
    'code' => 11127,
    'city' => 'Нижнекамск',
  ),
  121 => 
  array (
    'code' => 47,
    'city' => 'Нижний Новгород',
  ),
  122 => 
  array (
    'code' => 11168,
    'city' => 'Нижний Тагил',
  ),
  123 => 
  array (
    'code' => 148,
    'city' => 'Николаев',
  ),
  124 => 
  array (
    'code' => 237,
    'city' => 'Новокузнецк',
  ),
  125 => 
  array (
    'code' => 10830,
    'city' => 'Новомосковск',
  ),
  126 => 
  array (
    'code' => 970,
    'city' => 'Новороссийск',
  ),
  127 => 
  array (
    'code' => 65,
    'city' => 'Новосибирск',
  ),
  128 => 
  array (
    'code' => 238,
    'city' => 'Новочеркасск',
  ),
  129 => 
  array (
    'code' => 10742,
    'city' => 'Ногинск',
  ),
  130 => 
  array (
    'code' => 11311,
    'city' => 'Норильск',
  ),
  131 => 
  array (
    'code' => 967,
    'city' => 'Обнинск',
  ),
  132 => 
  array (
    'code' => 145,
    'city' => 'Одесса',
  ),
  133 => 
  array (
    'code' => 10743,
    'city' => 'Одинцово',
  ),
  134 => 
  array (
    'code' => 11214,
    'city' => 'Озерск',
  ),
  135 => 
  array (
    'code' => 66,
    'city' => 'Омск',
  ),
  136 => 
  array (
    'code' => 10,
    'city' => 'Орел',
  ),
  137 => 
  array (
    'code' => 48,
    'city' => 'Оренбург',
  ),
  138 => 
  array (
    'code' => 10745,
    'city' => 'Орехово-Зуево',
  ),
  139 => 
  array (
    'code' => 11091,
    'city' => 'Орск',
  ),
  140 => 
  array (
    'code' => 10746,
    'city' => 'Павловский Посад',
  ),
  141 => 
  array (
    'code' => 190,
    'city' => 'Павлодар',
  ),
  142 => 
  array (
    'code' => 49,
    'city' => 'Пенза',
  ),
  143 => 
  array (
    'code' => 10837,
    'city' => 'Переславль',
  ),
  144 => 
  array (
    'code' => 50,
    'city' => 'Пермь',
  ),
  145 => 
  array (
    'code' => 18,
    'city' => 'Петрозаводск',
  ),
  146 => 
  array (
    'code' => 78,
    'city' => 'Петропавловск-Камчатский',
  ),
  147 => 
  array (
    'code' => 10747,
    'city' => 'Подольск',
  ),
  148 => 
  array (
    'code' => 11291,
    'city' => 'Прокопьевск',
  ),
  149 => 
  array (
    'code' => 25,
    'city' => 'Псков',
  ),
  150 => 
  array (
    'code' => 10748,
    'city' => 'Пушкино',
  ),
  151 => 
  array (
    'code' => 217,
    'city' => 'Пущино',
  ),
  152 => 
  array (
    'code' => 11067,
    'city' => 'Пятигорск',
  ),
  153 => 
  array (
    'code' => 10750,
    'city' => 'Раменское',
  ),
  154 => 
  array (
    'code' => 21621,
    'city' => 'Реутов',
  ),
  155 => 
  array (
    'code' => 10820,
    'city' => 'Ржев',
  ),
  156 => 
  array (
    'code' => 10355,
    'city' => 'Ровно',
  ),
  157 => 
  array (
    'code' => 10838,
    'city' => 'Ростов',
  ),
  158 => 
  array (
    'code' => 39,
    'city' => 'Ростов-на-Дону',
  ),
  159 => 
  array (
    'code' => 11251,
    'city' => 'Рубцовск',
  ),
  160 => 
  array (
    'code' => 10839,
    'city' => 'Рыбинск',
  ),
  161 => 
  array (
    'code' => 11,
    'city' => 'Рязань',
  ),
  162 => 
  array (
    'code' => 11115,
    'city' => 'Салават',
  ),
  163 => 
  array (
    'code' => 58,
    'city' => 'Салехард',
  ),
  164 => 
  array (
    'code' => 51,
    'city' => 'Самара',
  ),
  165 => 
  array (
    'code' => 2,
    'city' => 'Санкт-Петербург',
  ),
  166 => 
  array (
    'code' => 42,
    'city' => 'Саранск',
  ),
  167 => 
  array (
    'code' => 11152,
    'city' => 'Сарапул',
  ),
  168 => 
  array (
    'code' => 194,
    'city' => 'Саратов',
  ),
  169 => 
  array (
    'code' => 11083,
    'city' => 'Саров',
  ),
  170 => 
  array (
    'code' => 20258,
    'city' => 'Сатис',
  ),
  171 => 
  array (
    'code' => 11217,
    'city' => 'Сатка',
  ),
  172 => 
  array (
    'code' => 11341,
    'city' => 'Саяногорск',
  ),
  173 => 
  array (
    'code' => 959,
    'city' => 'Севастополь',
  ),
  174 => 
  array (
    'code' => 10849,
    'city' => 'Северодвинск',
  ),
  175 => 
  array (
    'code' => 11351,
    'city' => 'Северск',
  ),
  176 => 
  array (
    'code' => 10752,
    'city' => 'Сергиев Посад',
  ),
  177 => 
  array (
    'code' => 10754,
    'city' => 'Серпухов',
  ),
  178 => 
  array (
    'code' => 146,
    'city' => 'Симферополь',
  ),
  179 => 
  array (
    'code' => 12,
    'city' => 'Смоленск',
  ),
  180 => 
  array (
    'code' => 11218,
    'city' => 'Снежинск',
  ),
  181 => 
  array (
    'code' => 11110,
    'city' => 'Соликамск',
  ),
  182 => 
  array (
    'code' => 10755,
    'city' => 'Солнечногорск',
  ),
  183 => 
  array (
    'code' => 10937,
    'city' => 'Сортавала',
  ),
  184 => 
  array (
    'code' => 239,
    'city' => 'Сочи',
  ),
  185 => 
  array (
    'code' => 36,
    'city' => 'Ставрополь',
  ),
  186 => 
  array (
    'code' => 10649,
    'city' => 'Старый Оскол',
  ),
  187 => 
  array (
    'code' => 11116,
    'city' => 'Стерлитамак',
  ),
  188 => 
  array (
    'code' => 10756,
    'city' => 'Ступино',
  ),
  189 => 
  array (
    'code' => 10671,
    'city' => 'Суздаль',
  ),
  190 => 
  array (
    'code' => 965,
    'city' => 'Сумы',
  ),
  191 => 
  array (
    'code' => 973,
    'city' => 'Сургут',
  ),
  192 => 
  array (
    'code' => 11139,
    'city' => 'Сызрань',
  ),
  193 => 
  array (
    'code' => 19,
    'city' => 'Сыктывкар',
  ),
  194 => 
  array (
    'code' => 971,
    'city' => 'Таганрог',
  ),
  195 => 
  array (
    'code' => 13,
    'city' => 'Тамбов',
  ),
  196 => 
  array (
    'code' => 14,
    'city' => 'Тверь',
  ),
  197 => 
  array (
    'code' => 11175,
    'city' => 'Тобольск',
  ),
  198 => 
  array (
    'code' => 240,
    'city' => 'Тольятти',
  ),
  199 => 
  array (
    'code' => 67,
    'city' => 'Томск',
  ),
  200 => 
  array (
    'code' => 20674,
    'city' => 'Троицк',
  ),
  201 => 
  array (
    'code' => 1058,
    'city' => 'Туапсе',
  ),
  202 => 
  array (
    'code' => 15,
    'city' => 'Тула',
  ),
  203 => 
  array (
    'code' => 11391,
    'city' => 'Тында',
  ),
  204 => 
  array (
    'code' => 55,
    'city' => 'Тюмень',
  ),
  205 => 
  array (
    'code' => 10840,
    'city' => 'Углич',
  ),
  206 => 
  array (
    'code' => 10358,
    'city' => 'Ужгород',
  ),
  207 => 
  array (
    'code' => 198,
    'city' => 'Улан-Удэ',
  ),
  208 => 
  array (
    'code' => 195,
    'city' => 'Ульяновск',
  ),
  209 => 
  array (
    'code' => 11426,
    'city' => 'Уссурийск',
  ),
  210 => 
  array (
    'code' => 11273,
    'city' => 'Усть-Илимск',
  ),
  211 => 
  array (
    'code' => 10306,
    'city' => 'Усть-Каменогорск',
  ),
  212 => 
  array (
    'code' => 172,
    'city' => 'Уфа',
  ),
  213 => 
  array (
    'code' => 10945,
    'city' => 'Ухта',
  ),
  214 => 
  array (
    'code' => 11469,
    'city' => 'Феодосия',
  ),
  215 => 
  array (
    'code' => 76,
    'city' => 'Хабаровск',
  ),
  216 => 
  array (
    'code' => 57,
    'city' => 'Ханты-Мансийск',
  ),
  217 => 
  array (
    'code' => 10758,
    'city' => 'Химки',
  ),
  218 => 
  array (
    'code' => 45,
    'city' => 'Чебоксары',
  ),
  219 => 
  array (
    'code' => 56,
    'city' => 'Челябинск',
  ),
  220 => 
  array (
    'code' => 968,
    'city' => 'Череповец',
  ),
  221 => 
  array (
    'code' => 10363,
    'city' => 'Черкассы',
  ),
  222 => 
  array (
    'code' => 1104,
    'city' => 'Черкесск',
  ),
  223 => 
  array (
    'code' => 219,
    'city' => 'Черноголовка',
  ),
  224 => 
  array (
    'code' => 10761,
    'city' => 'Чехов',
  ),
  225 => 
  array (
    'code' => 11129,
    'city' => 'Чистополь',
  ),
  226 => 
  array (
    'code' => 68,
    'city' => 'Чита',
  ),
  227 => 
  array (
    'code' => 11053,
    'city' => 'Шахты',
  ),
  228 => 
  array (
    'code' => 10765,
    'city' => 'Щелково',
  ),
  229 => 
  array (
    'code' => 20523,
    'city' => 'Электросталь',
  ),
  230 => 
  array (
    'code' => 1094,
    'city' => 'Элиста',
  ),
  231 => 
  array (
    'code' => 11147,
    'city' => 'Энгельс',
  ),
  232 => 
  array (
    'code' => 80,
    'city' => 'Южно-Сахалинск',
  ),
  233 => 
  array (
    'code' => 74,
    'city' => 'Якутск',
  ),
  234 => 
  array (
    'code' => 11470,
    'city' => 'Ялта',
  ),
  235 => 
  array (
    'code' => 16,
    'city' => 'Ярославль',
  ),
);
