[
    {
        "id": 1674853,
        "likes": 1634,
        "reposts": 254,
        "text": "Шпаргалка по сложности алгоритмов.\n\nВ левой части шпаргалки — сравнение структур данных по скорости операций. А в правой — скорость алгоритмов сортировки.\n\nОригинал в высоком разрешении: https://vk.cc/aw2KxE\n\nСохраняйте себе и используйте при необходимости.\n\n#алгоритмы@tproger #шпаргалка@tproger"
    },
    {
        "id": 1689099,
        "likes": 0,
        "reposts": 0,
        "text": "С 15 по 17 сентября пройдёт конференция о том, что делает инженеров и руководителей профессионалами. Ждите доклады и воркшопы про коммуникации, обучение, осознанность и управление командами. \n \nЧитайте подробности и записывайтесь: https://tprg.ru/bL3t\n \nЭто #партнёрский пост"
    },
    {
        "id": 1689082,
        "likes": 85,
        "reposts": 9,
        "text": "Разработчица из Едадила рассказала, что такое тестирование ПО на Python, какие бывают тесты и зачем их писать.\n\nВ видео на простых примерах можно узнать про библиотеки для тестирования Python-кода (unittest, pytest, mock), принципы их работы и отличия между ними.\n\nА текстовая версия доклада есть здесь: https://tprg.ru/k6zH\n\n#python@tproger #яндекс@tproger"
    },
    {
        "id": 1689007,
        "likes": 272,
        "reposts": 14,
        "text": "Энтузиаст своими руками собрал компьютер в столе с жидкостной системой охлаждения, а в этой статье подробной рассказал про процесс сборки:\n\nhttps://tprg.ru/UApB\n\n#hardware@tproger #diy@tproger"
    },
    {
        "id": 1688974,
        "likes": 115,
        "reposts": 4,
        "text": "Учёные из университета Пердью создали бумажную клавиатуру, которую можно просто распечатать и использовать даже без элементов питания.\n\nВся соль в процессе печати и особых чернилах с высоким содержанием фтора. Благодаря ним, клавиатура не требует внешнего питания, вырабатывая электричество во время касания пальцев. Этого электричества как раз хватает для передачи сигналов по Bluetooth, а значит, клавиатуру легко можно подключить к компьютеру.\n\nКонечно, от бумажной клавиатуры в таком виде нет особой пользой. Но это уверенный шаг в сторону, например, умной упаковки с элементами управления.\n\n#технологии@tproger #hardware@tproger"
    },
    {
        "id": 1688939,
        "likes": 423,
        "reposts": 27,
        "text": "OpenCV — бесплатная библиотека с несложными алгоритмами, которые используются в распознавании объектов на фото или видео, в 3D-рендере, в поиске идентичных изображений и много где ещё. Изначально она была написана на C++, но сегодня имеет интерфейсы на Java, MATLAB и даже на Python (в этой статье как раз его и используют).\n\nНа крутых примерах и, самое главное, с пёсиками в статье показывают, как использовать OpenCV в своих проектах:\n\nhttps://tprg.ru/qEnG\n\n#python@tproger #opencv@tproger"
    },
    {
        "id": 1688921,
        "likes": 100,
        "reposts": 4,
        "text": "Двое программистов создали виртуальную комнату, в которой благодаря взаимодействию с интерьером генерируется Lo-Fi музыка.\n\nНесколько музыкальных инструментов, шумы из окна, разные ритмы и настроения — в ней есть почти всё для создания идеального звукового фона. На странице проекта можно почитать о том, на что она способна и даже самостоятельно опробовать её в действии: https://tprg.ru/iCWc\n\nРазработка основана на magenta.js, а исходный код на GitHub в вашем полном распоряжении: https://github.com/magenta/lofi-player\n\n#нейросети@tproger #алгоритмы@tproger"
    },
    {
        "id": 1688887,
        "likes": 557,
        "reposts": 78,
        "text": "Дорожная карта по Computer Science, в которой собраны необходимые для изучения темы и конкретные технологии:\n\nhttps://tprg.ru/HPT7\n\n#computerscience@tproger #шпаргалка@tproger"
    },
    {
        "id": 1688836,
        "likes": 163,
        "reposts": 9,
        "text": "«Зачем мне курсы? Есть же видосики, книжули, Stack Overflow...» \n \nУзнали? Согласны? \n \nМы дали 10 честных ответов об онлайн-курсах по программированию. Только информация, никакой рекламы: \n \nhttps://tproger.ru/articles/online-courses/ \n \n#курсы@tproger"
    },
    {
        "id": 1688823,
        "likes": 237,
        "reposts": 9,
        "text": "Курьеры Amazon Flex устанавливают смартфоны на деревьях, чтобы получать больше заказов.\n\nЧтобы разобраться, как это работает, нужно понять алгоритм распределения заказов. Он похож на алгоритм в Uber: какой курьер ближе всего к магазину, тот и получает заказ первым. Речь может идти буквально о паре метров.\n\nСмартфоны на деревьях возле магазинов быстрее всех принимают заказы, имитируя курьеров, а затем раздают эти заказы настоящим курьерам, которые задействованы в этой схеме.\n\nЧто самое интересное, заметили это не в Amazon, а сами курьеры, которые заподозрили, что некоторые их коллеги подозрительно часто оказываются в выигрыше. А теперь своё расследование начали и в Amazon.\n\n#amazon@tproger"
    },
    {
        "id": 1688820,
        "likes": 133,
        "reposts": 8,
        "text": "Собрали в подборку наши лучшие материалы прошлой недели:\n\n— Как стать разработчиком игр: https://tprg.ru/UzD3\n\n— 7 вопросов из ЕГЭ по информатике: https://tprg.ru/XyYf\n\n— Применение структур данных и алгоритмов на практике: https://tprg.ru/5fLv\n\n— Угадайте игру по факту о ней: https://tprg.ru/Xun3\n\n#лучшеезанеделю@tproger"
    },
    {
        "id": 1688782,
        "likes": 169,
        "reposts": 10,
        "text": "Как за 2 минуты узнать о всех существующих облачных сервисах от Amazon? Этот парень точно знает:\n\n#aws@tproger"
    },
    {
        "id": 1688766,
        "likes": 192,
        "reposts": 5,
        "text": "Как научить компьютер играть в Тетрис, да так, чтобы он легко бил мировые рекорды?\n\nБлоггер Code Bullet создал «убийцу тетриса» на JavaScript и подробно рассказал о деталях реализации: https://tprg.ru/Jfl0\n\nА если вам лень смотреть 18 минут видео или вы не можете в английский, короткий локализованный пересказ есть здесь: https://tprg.ru/QKS6\n\n#javascript@tproger #алгоритмы@tproger"
    },
    {
        "id": 1688755,
        "likes": 23,
        "reposts": 1,
        "text": "С 12 по 14 сентября пройдёт онлайн-хакатон в Приволжском IT-хабе. Участники будут решать на выбор один из 10 представленных кейсов от АО «Газпромбанк», ПАО «Россети», Почты России, ПАО «Ростелеком», АО «Газпром-медиа Холдинг», Госкорпорации «Росатом». \n \nПобедители разделят призовой фонд 3 000 000 ₽: https://tprg.ru/uf1L\n \nЭто #партнёрский пост"
    },
    {
        "id": 1688745,
        "likes": 304,
        "reposts": 22,
        "text": "У Microsoft на гитхабе есть репозиторий, в котором они собрали лучшие практики, примеры кода и документацию по их сервису Computer Vision для распознавания объектов на изображениях:\n\nhttps://github.com/microsoft/computervision-recipes\n\n#microsoft@tproger #computervision@tproger"
    },
    {
        "id": 1688675,
        "likes": 488,
        "reposts": 23,
        "text": "Microsoft разработала инструмент для выявления дипфейков.\n\nИнструмент называется Microsoft Video Authenticator. Он способен анализировать как фотографии, так и видео. Также в Microsoft напрямую заявили, что обнаружение дипфейков имеет решающее значение в преддверии выборов в США для борьбы с дезинформацией.\n\nЧто ж, отличный инструмент, чтобы тренировать на нём дипфейк-алгоритмы.\n\n#дипфейк@tproger #microsoft@tproger"
    },
    {
        "id": 1688649,
        "likes": 42,
        "reposts": 5,
        "text": "Ближайшие события для айтишников: \n \n— Интенсив «Мессенджер на Python за 3 дня» \n7–9 сентября, онлайн, https://tprg.ru/6pJ3 \n \nНа трёхдневном интенсиве участники изучат основы разработки на Python и смогут создать своё первое приложение. Авторы лучших работ получат сертификат на обучение в Skillbox. \n \n— Хакатон DemHack \n12–13 сентября, Москва, https://tprg.ru/Y4Ul \n \nУчастники разработают IT-решения, которые помогут в реализации общественных интересов в сфере цифровых прав и гражданства, лучшие смогут развить проекты на буткемпе и разделят призовой фонд в 1 500 000 ₽. \n \n— Курс «Профессия Data Scientist» с трудоустройством \nСтарт 8 сентября, онлайн, https://tprg.ru/nfEN \n \nЗа полтора года получите и отработаете самые важные навыки на практических задачах, получите две топовых специализации и сможете пойти работать Junior Data Scientist.\n\n— Хакатон PhotoHack Mobile \n12–13 сентября, онлайн, https://bit.ly/3l50pQx \n \nУчастникам предстоит разработать мобильное приложение на базе API Photo Lab. Это должен быть нишевый продукт, направленный на решение конкретной задачи на выбор участников. \n \n— Конференция MOBILE Z-DAYS \n8–10 сентября, онлайн, https://tprg.ru/5lsN \n \nБесплатная онлайн конференция, на которой поговорят про непрерывное обучение, безопасность Android-приложений и разработку игр с использованием Flutter. \n \n— Scoring Case Forum 2020 \n8 сентября, онлайн, https://tprg.ru/ANxL \n \nЭксперты расскажут о применении технологий Big Data и машинного обучения для кредитной оценки физических лиц, малого и среднего бизнеса в online и offline-каналах. \n \n#ивенты@tproger"
    },
    {
        "id": 1688637,
        "likes": 314,
        "reposts": 20,
        "text": "Нужны ли в работе алгоритмы и структуры данных, или это просто страшилки для собеседований? \n\nГергели Орош — разработчик с опытом работы в Uber, Skype и Skyscanner — показал на примерах, как он и его команда применяли алгоритмы и структуры данных в реальных проектах:\n\nhttps://tproger.ru/translations/applying-data-structures-and-algorithms/ \n\n#алгоритмы@tproger"
    },
    {
        "id": 1688615,
        "likes": 244,
        "reposts": 32,
        "text": "Подборка уроков по разработке на Python для начинающих — 2D игра с использованием PyGame, парсер сайтов, классификатор слов на основе машинного обучения и многое другое:\n\nhttps://www.codewithrepl.it/python-projects-for-beginners.html\n\n#python@tproger"
    },
    {
        "id": 1688597,
        "likes": 33,
        "reposts": 2,
        "text": "Актуальные вакансии для IT-специалистов:\n\n— Системный аналитик в «Спортмастер»: https://tprg.ru/5Ov6\nКраснодар, оклад от 80 000 до 130 000 ₽ \n \n— PHP-разработчик (Magento) в AGIMA: https://tprg.ru/wnua\nСтек: PHP 7, Magento, RabbitMQ, MySQL \nУдалённо, опыт от 3 лет, оклад от 180 000 ₽ \n \n— Backend developer (Node.js) в Wazzup: https://tprg.ru/fbX7\nСтек: Kubernetes, PostgreSQL, Node.js, RabbitMQ, Tarantool, Redis, Sentry \nМосква или удалённо, опыт от 1 года, оклад от 80 000 до 120 000 ₽ \n \n— Аналитик в Nexign: https://tprg.ru/9yvh\nСанкт-Петербург, опыт от 3 лет, оклад по итогам собеседования \n \n— Teamlead / Senior Backend Developer в FITMOST: https://tprg.ru/xt1S\nСтек: PHP 7, Yii 2, Linux (bash), MySQL, Docker, Git \nМосква, опыт от 6 лет, оклад от 180 000 ₽ \n \n#вакансии@tproger #работа@tproger"
    },
    {
        "id": 1688551,
        "likes": 169,
        "reposts": 6,
        "text": "Дизайнер собрал мини-iMac размером с баночку Red Bull. Внешние детали распечатал сам на 3D-принтере, а внутренность собрал с помощью Raspberry Pi. В итоге даже в Minecraft поиграл.\n\nВидео, в котором автор рассказал о подробностях сборки, на YouTube: https://youtu.be/wRsn2f6dxCk\n\n#hardware@tproger #raspberry@tproger"
    },
    {
        "id": 1688521,
        "likes": 93,
        "reposts": 12,
        "text": "Подборка книг для тех, кто делает игры, в двух частях:\n\n— 1 часть: https://tprg.ru/9xvI\n— 2 часть: https://tprg.ru/Oe75\n\nОт книг по сценарному мастерству и проектированию окружающей среды до секретов творчества от Сальвадора Дали.\n\n#gamedev@tproger #книги@tproger"
    },
    {
        "id": 1688468,
        "likes": 146,
        "reposts": 7,
        "text": "Разработчик ушёл на удалёнку, но решил, что этого ему мало. И решил уйти в VR.\n\nКупил VR-шлем за $500, поставил 3 монитора, поработал в таком режиме месяц и теперь делится своим опытом:\n\nhttps://tprg.ru/dc3G\n\n#vr@tproger #удалёнка@tproger"
    },
    {
        "id": 1688459,
        "likes": 8,
        "reposts": 0,
        "text": "За полтора года обучения получите две полноценные специализации — аналитика данных и специалиста по машинному обучению. Разработаете несколько алгоритмов для решения реальных задач и сможете показать их будущему работодателю. \n \nНа курсе преподают только практикующие эксперты из крупных компаний, а начинать учиться можно и вовсе без опыта. Все полученные знания отработаете на решении реальных задач. \n \nОставляйте данные на сайте и пользуйтесь нашим промокодом TPROGER: https://tprg.ru/nfEN\n \nЭто #партнёрский пост"
    },
    {
        "id": 1688372,
        "likes": 339,
        "reposts": 7,
        "text": "Студент из Сингапура собрал приставку из арбуза.\n\nДля этого ему понадобился собственно сам арбуз и несколько деталей: Raspberry Pi, кнопки-контроллеры, динамики, небольшой дисплей, куча проводов и пауэрбанк.\n\nПодробнее посмотреть на процесс создания приставки можно в небольшом видео блогера: https://tprg.ru/vJ0H\n\n#diy@tproger #raspberry@tproger"
    },
    {
        "id": 1688360,
        "likes": 48,
        "reposts": 1,
        "text": "Пост для тех, кто хочет помочь новичкам научиться кодить: Яндекс.Практикум ищет наставников на IT факультеты.\n\nПрокачаете навыки коммуникации и менеджмента, получите дополнительный заработок плюс топовую строчку в резюме и вектор в сторону тимлида/CTO. Познакомитесь с другими разработчиками того же уровня, что и вы, а ещё с вашими потенциальными джунами.\n\nНа выбор есть веб, бэкенд, Python, анализ данных, Data Science, тестирование, дизайн интерфейсов и интернет-маркетинг. Программу составлять не придётся, студенты занимаются в онлайн-тренажёре.\n\nВам нужно быть мидл+ специалистом и иметь несколько часов в неделю для общения с учениками. \n\nПрочитайте подробнее о наставничестве в нашей статье: https://tproger.ru/articles/sharing-knowledge/\n\nИли сразу выберите свой факультет: https://tprg.ru/WYBc\n\nЭто #партнёрский пост"
    },
    {
        "id": 1688318,
        "likes": 174,
        "reposts": 6,
        "text": "Можно долго спорить, где import лучше — в Python 2 или 3. Но бывают ситуации, когда необходимо написать универсальное решение для обоих версий.\n\nВ этой статье разобрали если не всё, то почти всё, что касается импортов в Python — как для второй, так и третьей версии:\n\nhttps://tprg.ru/htCU\n\n#python@tproger"
    },
    {
        "id": 1688241,
        "likes": 157,
        "reposts": 7,
        "text": "Программисты из Postuf разработали решение для Telegram, которое позволяет скрывать разные аккаунты и открывать их только через уникальный код-пароль.\n\nПричём стандартный интерфейс приложения абсолютно никак не изменился, добавился всего один пункт в настройках конфиденциальности (который доступен лишь в течение 1 минуты после авторизации в основном аккаунте, поэтому сторонний пользователь вообще никак не узнает об использовании фичи).\n\nДля чего такая фича может понадобиться? Например, для неприятных ситуаций, когда пользователь будет вынужден разблокировать и показать содержимое Telegram. Так совпало, что релиз пришёлся как раз на то время, когда в Беларуси людей активно задерживают в том числе после проверок подписок и переписок в Telegram.\n\nТеперь разработчики хотят, чтобы Павел Дуров ознакомился с их решением. Для этого они запустили хештег #ДуровДобавьДвойноеДно. Подробнее о работе фичи ребята рассказали в этой статье:\n\nhttps://tprg.ru/CV0Q\n\n#telegram@tproger #безопасность@tproger"
    },
    {
        "id": 1688221,
        "likes": 40,
        "reposts": 0,
        "text": "Курс по игровому программированию на C++ в Unreal\n \nЗа 5 месяцев вы научитесь писать код, который позволит персонажам двигаться, перемещаться, стрелять и взаимодействовать с окружающим миром, а также получите навыки, необходимые для работы геймплей-программистом. \n \nСпециально для подписчиков подготовили промокод «PROG». Он даст скидку 10% на покупку курса. \n \nЧитайте подробнее и начинайте изучать программирование для Action-игр уже сейчас: https://bit.ly/34B2m1g\n\nЭто #партнёрский пост"
    },
    {
        "id": 1688134,
        "likes": 192,
        "reposts": 4,
        "text": "Как хорошо вы разбираетесь в компьютерных играх? Мы подготовили тест, в котором собрали много интересных фактов об игровом мире. Вам предстоит угадать откуда тот или иной факт: \n\nhttps://tproger.ru/quiz/guess-game-by-fact/ \n\n#игры@tproger #тесты@tproger"
    },
    {
        "id": 1688130,
        "likes": 15,
        "reposts": 0,
        "text": "Хинт для программистов: если зарегистрироваться на соревнования Huawei Honor Cup, которые проходят сейчас, то бесплатно получите доступ к онлайн-школе для участников. Можно прокачаться по разным навыкам и ещё, возможно, выиграть $10 000 в самом соревновании. \n\nРегистрация ещё открыта: https://tprg.ru/JUkC\n\nЭто #партнёрский пост"
    },
    {
        "id": 1688102,
        "likes": 322,
        "reposts": 30,
        "text": "Разработчик выпустил консольную тулзу для создания презентаций. Выглядит гораздо лучше, чем PowerPoint.\n\nИнструкция по установке и использованию есть на гитхабе:\n\nhttps://github.com/vinayak-mehta/present \n\n#консоль@tproger"
    },
    {
        "id": 1688061,
        "likes": 295,
        "reposts": 5,
        "text": "Исследователь из США создал ИИ, который генерирует идеальный рецепт сэндвича с бананом и арахисовой пастой.\n\nАлгоритм определяет, как должен быть нарезан банан, чтобы расположить его на хлебе наилучшим образом. Затем модель вычисляет количество арахисовой пасты для конкретного банана и кусочка хлеба.\n\nДля тех, кто хочет готовить идеальный сэндвич по утрам, но никак не получается, автор выложил алгоритм в открытый доступ на гитхаб:\n\nhttps://github.com/EthanRosenthal/nannernest\n\nА в отдельной статье он подробно расписал работу алгоритма:\n\nhttps://tprg.ru/isMk\n\n#ии@tproger #алгоритмы@tproger"
    },
    {
        "id": 1687995,
        "likes": 272,
        "reposts": 7,
        "text": "Можно плохо разбираться в нейросетях, не знать всех языков программирования и с трудом понимать чужой код. Но со школьной программой информатики, казалось бы, должен справиться каждый айтишник.\n\nТак ли это? Узнайте, что требуют с нынешних школьников, и проверьте свои знания на реальных задачках ЕГЭ в нашем новом тесте:\n\nhttps://tproger.ru/quiz/computer-science-exam-test/\n\n#тесты@tproger"
    },
    {
        "id": 1687985,
        "likes": 124,
        "reposts": 5,
        "text": "Диаграммы — такой же инструмент коммуникации, как разговор по видео или сообщение в Slack.\n\nНо что делать, если хочется вложить диаграмму в текстовый файл или прямо в комментарий к коду? А если нужна такая, которую хотелось бы встроить на сайт и дать «потрогать» её посетителям? А что если вообще нет желания строить диаграммы, и хочется, чтобы они создавались автоматически на основе вашего кода?\n\nНе удивляйтесь, но для всего этого есть свои сервисы. В этой статье вы подробнее узнаете о сервисах для создания диаграмм — от must have до самых необычных:\n\nhttps://tprg.ru/ac8d\n\n#инструменты@tproger #документация@tproger"
    },
    {
        "id": 1687923,
        "likes": 88,
        "reposts": 1,
        "text": "Энтузиаст собрал фоторамку, которая не просто листает фотки, а показывает целый фильм по 30 кадров в час.\n\nИнтересно, что в качестве экрана используется дисплей с электронными чернилами. И несмотря на использование Raspberry Pi, всю начинку удалось уместить в обычную фоторамку. Вышло дороговато (на август 2020 ~$170), но в сочетании с фильмами Хичкока, замедленными до 30 кадров в час, кажется, оно того стоит.\n\nПроцесс сборки он подробно описал здесь: https://tprg.ru/AWgH\n\n#hardware@tproger #diy@tproger"
    },
    {
        "id": 1687857,
        "likes": 361,
        "reposts": 30,
        "text": "Зарелизилось приложение для простого совместного кодинга GitDuck.\n\nПриложение интересно тем, что напоминает эдакий видеочат для программистов и встраивается прямо в IDE. Оно даёт возможность видеть действия друг друга, разговаривать, править и выделять код. Получается ламповый эффект «подошел и смотришь в экран коллеги» для удалёнки:\n\nhttps://gitduck.com/\n\nFree-версия ограничивается 45 минутами на звонок (как в своё время в Zoom). Но кто работал с громоздкими Slack'ами с их Code Pair, наверняка заценит. К тому же каждые 45 минут, например, можно делать перерыв.\n\n#ide@tproger"
    },
    {
        "id": 1687833,
        "likes": 197,
        "reposts": 15,
        "text": "Мечтаете разрабатывать игры, которые бы всем нравились и запускались на любом компе? Это невозможно. \n \nНо возможно вот что. Мы подготовили небольшой гайд по старту в разработке игр — без сверхсекретных хинтов и «как войти в геймдев за 5 минут». В статье есть краткий план, полезные инструменты и советы от специалистов в игровой индустрии: \n \nhttps://tproger.ru/articles/game-developer-guide/ \n \n#gamedev@tproger"
    },
    {
        "id": 1687803,
        "likes": 134,
        "reposts": 18,
        "text": "Делимся нашими лучшими материалами за прошлую неделю:\n\n— Как работает алгоритм хеширования SHA-2 шаг за шагом: https://tprg.ru/kBxw\n\n— 25 распространённых вопросов по SQL с собеседований и ответы на них: https://tprg.ru/q7p5\n\n— Как сделать умный дом на Arduino и голосовом помощнике Алисе: https://tprg.ru/e2oZ\n\n— Что такое хорошее ТЗ и как его составить: https://tprg.ru/ndmE\n\n#лучшеезанеделю@tproger"
    },
    {
        "id": 1687658,
        "likes": 65,
        "reposts": 0,
        "text": "По данным Работы.ру, 26% опрошенных россиян, которые перешли на работу из дома во время самоизоляции, остаются на удалёнке. А 47% хотели бы продолжить работать дистанционно. А вы что думаете?\n\n#обсуждение@tproger"
    },
    {
        "id": 1687618,
        "likes": 219,
        "reposts": 10,
        "text": "Австралийские учёные (очевидно по фото) разработали технологию применения человеческих волос для производства гибких дисплеев.\n\nС помощью этой технологии небольшие пряди волос превращаются в углеродные наноточки. Учёные говорят, что из-за насыщенности волос углеродом и водородом они хорошо подходят в качестве сырья для создания дисплеев по технологии OLED.\n\nОтмечается, что источником сырья для исследования стала ближайшая к исследовательскому центру парикмахерская.\n\nПодробнее о технологии можно почитать тут: https://tprg.ru/ht3n\n\n#технологии@tproger #физика@tproger"
    },
    {
        "id": 1687596,
        "likes": 686,
        "reposts": 19,
        "text": "Ещё Джейсон Стейтем говорил: «Без хорошего ТЗ результат хз». Но что такое — хорошее ТЗ и как его составить?\n\nВыяснили у экспертов и делимся ответами с вами:\n\nhttps://tproger.ru/experts/writing-good-technical-task/\n\n#эксперты@tproger #тз@tproger"
    },
    {
        "id": 1687532,
        "likes": 207,
        "reposts": 24,
        "text": "Очередная визуализация сортировок.\n\nИсходники этой визуализации на гитхабе: https://github.com/w0rthy/ArrayVisualizer\n\n#сортировка@tproger"
    },
    {
        "id": 1687528,
        "likes": 11,
        "reposts": 0,
        "text": "МегаФон приглашает разработчиков в свою команду\n\nНа поиск стоящих вакансий могут уйти многие месяцы. Особенно в такой сфере, как программирование.\n\nУпростите себе задачу: на https://clck.ru/QXLmo более 2 000 вакансий от МегаФона для настоящих профи.\n\nПрисоединяйтесь к команде МегаФона.\n\nЭто #партнёрский пост"
    },
    {
        "id": 1687497,
        "likes": 679,
        "reposts": 93,
        "text": "Подборка бесплатных книг по программированию на русском языке на гитхабе:\n\nhttps://tprg.ru/932L \n\nЕсть как общие книги по алгоритмам, тестированию и операционным системам, так и по конкретным технологиям и языкам: C++, Go, Java, Android, Python, SQL.\n\n#книги@tproger"
    },
    {
        "id": 1687452,
        "likes": 159,
        "reposts": 9,
        "text": "Учёные создали робота, которому для работы нужен только спирт. И нет, это не кибер-трудовик, это робожук.\n\nВнутри робота RoBeetle сжигаются пары метанола, заставляя крошечные проводки из никель-титанового сплава — искусственные мышцы робота — расширяться и сжиматься по мере остывания.\n\nНесмотря на то, что RoBeetle весит всего 88 мг, он может переносить груз весом 230 мг. Конечно, у него есть и недостатки — он настолько целеустремлён, что может двигаться только вперёд. Также робот не умеет поворачивать, а его скорость не поддаётся регулировке.\n\n#роботы@tproger #наука@tproger"
    },
    {
        "id": 1687436,
        "likes": 12,
        "reposts": 0,
        "text": "Онлайн-хакатон для мобильных разработчиков PhotoHack Mobile\n\n12–13 сентября участники поборются за 500 000 ₽, создавая нишевое приложение, которое будет решать конкретную небольшую задачу. \n \nУчаствовать можно в командах до 5 человек, а регистрация открыта до 11 сентября, не зевайте: https://bit.ly/3l50pQx\n \nЭто #партнёрский пост"
    },
    {
        "id": 1687353,
        "likes": 845,
        "reposts": 39,
        "text": "Facebook решили использовать тепло дата-центров для отопления домов в небольшом датском городке.\n\nВ Оденсе у Facebook есть дата-центр площадью 50 000 м². Как оказалось, он выделяет столько тепла, что им можно согреть аж 7 000 домов. Осознав это и объединившись с местной ЖКХ-компанией, Facebook провела эксперимент, перенаправив тепло из дата-центра в радиаторы местной больницы и нескольких зданий. Как верно отметил мэр города, удивительно то, что это тепло создают лайки, картинки с котиками или мемы, которые мы постим.\n\nКонечно, само по себе это не новость. Тот же IBM ещё в 2008 году начал использовать тепло своего дата-центра в Швейцарии для обогрева местного бассейна. Да и вообще, у многих IT-компаний наблюдается тенденция «озеленения» технологий. Но история с Facebook примечательна ещё и тем, что дата-центр изначально работает от энергии ветра, что позволяет ему на 86% работать от возобновляемой энергии.\n\nВ общем, удивительный круговорот фоток котиков в природе.\n\n#facebook@tproger #технологии@tproger"
    },
    {
        "id": 1687303,
        "likes": 38,
        "reposts": 5,
        "text": "Как часто вы читаете сообщения от МЧС? По статистике, свыше 80% граждан удаляют их, даже не открыв. Именно поэтому SMS-рассылка от МЧС России будет заменена на звонки с голосами знаменитостей, что должно повысить информированность граждан о катаклизмах и стихийных бедствиях. \n\nПсихологи уже выбирают оптимальные голоса для системы оповещения Voicebox от MTT. Рассматриваются кандидатуры Ренаты Литвиновой, Елены Малышевой, Екатерины Андреевой, Александра Безрукова, Константина Хабенского и Сергея Шнурова.\n\nЗапуск сервиса запланирован на начало осени этого года. \n \nПодробнее читайте в статье: https://tprg.ru/pZWw"
    },
    {
        "id": 1687276,
        "likes": 117,
        "reposts": 4,
        "text": "Несмотря на небольшой возраст, Kotlin уже успел завоевать любовь сообщества программистов, а его лаконичность и безопасность — всё ещё одни из самых весомых преимуществ перед Java. \n\nВ этой статье собрали для вас распространённые способы «магического» использования функций Kotlin. Они помогут упростить написание и чтение кода:\n\nhttps://tprg.ru/rZ4x\n\n#kotlin@tproger"
    },
    {
        "id": 1687210,
        "likes": 172,
        "reposts": 5,
        "text": "Инженеры из MIT представили самоходный электровелосипед, приезжающий по вызову.\n\nЧтобы добавить велосипеду самостоятельности, им пришлось раздвоить заднее колесо. Оно складывается в одно, когда велосипедом кто-то управляет, и раздвигается, когда велосипед переходит в автономный режим. Конечно же в нём есть GPS и «датчики препятствий». Правда, из концепта не очень понятно, насколько они хороши и как работают.\n\nРазработка призвана усовершенствовать сервисы по прокату электрических велосипедов. Их клиентам неудобно добираться до станции подзарядки с севшей батареей, а компании-прокатчики неэффективно тратят свои ресурсы, собирая велосипеды по всему городу.\n\n#технологии@tproger #автопилот@tproger"
    },
    {
        "id": 1687173,
        "likes": 15,
        "reposts": 0,
        "text": "Почему специалисты из известных IT-компаний приходят в «Ростелеком»? \n\n«Ростелеком» уже давно трансформировался из интернет-провайдера в полноценную IT-компанию с разнообразными проектами и штатом из 6500 специалистов. \nА за последний год увеличилось количество откликов от кандидатов из других компаний, вроде Ozon, «Сбербанк» и Яндекс. \n\nЧем «Ростелеком» привлёк их больше? Ответы на этот и другие вопросы читайте в новой статье: https://tprg.ru/KqUN \n\nЭто #партнёрский пост"
    },
    {
        "id": 1687089,
        "likes": 245,
        "reposts": 10,
        "text": "Чтобы собрать умный дом, вам не обязательно закупать кучу дорогой техники. В сегодняшней статье подробно расскажем, как своими руками собрать умную лампочку. Контролировать её можно будет через голосовой помощник Алису:\n\nhttps://tproger.ru/articles/smart-home-on-arduino-and-alisa/ \n\n#arduino@tproger #яндекс@tproger #iot@tproger"
    },
    {
        "id": 1687028,
        "likes": 267,
        "reposts": 13,
        "text": "Программирование программированием, а личную жизнь устраивать тоже нужно. \n \nВ новой статье рассказываем, на что идут девушки, чтобы завоевать сердце айтишника: \n \nhttps://tproger.ru/articles/ways-to-say-i-love/ \n \nUPD: мы хотели написать шуточную статью, но оказалось, что смешно у нас не вышло, а писать серьёзно о любви — совсем не наш профиль. Поэтому мы удалили эту статью, а взамен по ссылке вы найдёте рекомендации других наших материалов."
    },
    {
        "id": 1687017,
        "likes": 32,
        "reposts": 1,
        "text": "Вакансии для разработчиков:\n\n— Java-программист (Middle–Senior) в GameShells: https://tprg.ru/XJbN\nУдалённо, опыт от 2 лет, оклад от 2000 $\n\n— SalesForce Solution Architect в Philip Morris: https://tprg.ru/jf9O\nМосква, оклад по итогам собеседования\n\n— Frontend developer (Vue) в «Спортмастер»: https://tprg.ru/Yslw\nЛипецк, оклад до 130 000 ₽\n\n— Backend разработчик в ZIP Service: https://tprg.ru/5gk1\nУдалённо, опыт от 3 лет, оклад от 100 000 ₽\n\n#вакансии@tproger #работа@tproger"
    },
    {
        "id": 1687002,
        "likes": 141,
        "reposts": 18,
        "text": "Нейронка МММ не создаёт финансовые пирамиды, но вполне годно генерирует музыку с учётом остальных дорожек.\n\nПросто добавьте дорожку и выберете инструмент, а нейронка займётся всем остальным. Можно сразу загрузить и дополнить какой-нибудь MIDI или воспользоваться готовыми демками. Как минимум, озвучка для инди-игр получается сносная, а сам автор даже поигрался с композициями Баха в туториалах.\n\nНа странице проекта можно почитать о Multi-Track Music Machine подробнее, посмотреть на что она способна и даже самостоятельно опробовать её в колабе. Ну очень залипательно:\n\nhttps://tprg.ru/xcJU\n\n#нейросети@tproger"
    },
    {
        "id": 1686991,
        "likes": 7,
        "reposts": 0,
        "text": "#вакансии@tproger #работа@tproger\nСанкт-Петербург, зарплата по итогам собеседования\n\nNexign, ведущий поставщик систем поддержки бизнеса и платформ IoT для крупных операторов связи, ищет Senior Automation QA в команду проекта Universal financial monitor. \n \nНужно будет развивать имеющиеся инструменты тестирования и писать новые, готовить тестовые сценарии и поддерживать весь цикл CI. Требуется опыт автоматизации на Java, работы с TestNG и Linux.\n \nИз плюшек можно выделить: \n— расширенный соцпакет (можно компенсировать расходы на спорт, отдых, книги и многое другое); \n— собственные центр обучения и мастер-классы; \n— терраса на крыше, спортзал и массажные кресла в офисе. \n \nБольше информации про задачи и преимущества: https://tprg.ru/ItRX"
    },
    {
        "id": 1686944,
        "likes": 245,
        "reposts": 8,
        "text": "Учёные создали киберсаранчу, которая помогла учёным распознать взрывчатку по запаху гораздо лучше собак.\n\nЧтобы считывать сигналы нейронов напрямую, саранче прямо в мозг имплантировали электроды. А само насекомое закрепили на роботизированной тележке, которой управляет оператор. На основании «ощущений» саранчи он решает, в какое место стоит направить устройство.\n\nПонадобился всего лишь один день тренировок, чтобы научить насекомое реагировать на TNT, DNT, RDX, PETN и нитрат аммония. И, что удивительно, даже различать их между собой.\n\n#наука@tproger"
    },
    {
        "id": 1686928,
        "likes": 16,
        "reposts": 2,
        "text": "С 29 по 31 августа участники со всей России решат задачи в стиле Capture The Flag по 6 направлениям: \n— Crypto — криптографическая защита информации. \n— PWN — поиск и эксплуатация бинарных уязвимостей. \n— PPC — программирование подсистем безопасности (professional programming and coding). \n— Reverse — обратная разработка и исследование программ. \n— Web — обнаружение веб-уязвимостей. \n— Forensic — расследование инцидентов в IT-сфере. \n \nПобедителей приглашают на образовательную программу по кибербезопасности от НТУ «Сириус» в Сочи. Регистрируйтесь до 28 августа: https://tprg.ru/thM3 \n \nЭто #партнёрский пост"
    },
    {
        "id": 1686875,
        "likes": 140,
        "reposts": 7,
        "text": "Как установить Windows 10 на Raspberry Pi 4? Подробная инструкция на русском:\n\nhttps://tprg.ru/93mx\n\n#windows@tproger #raspberry@tproger"
    },
    {
        "id": 1686832,
        "likes": 795,
        "reposts": 26,
        "text": "Программисты научили нейросеть по звуку, с которым ключ входит в замок, создавать слепок ключа для 3D-печати.\n\nДля замка с шестью штифтами возможны 586 584 варианта их положения. Нейросеть позволяет различить около 330 000 комбинаций — 56% от общего числа. Ориентируясь на звук, система подбирает несколько вариантов ключей — как правило, от трёх до 15 штук — один из которых подходит для открытия двери.\n\n#нейросети@tproger"
    },
    {
        "id": 1686818,
        "likes": 12,
        "reposts": 1,
        "text": "Яндекс устраивает баттл между Я.Эфиром и Okko и приглашает на конференцию о потоковом видео в интернете.\n\nВас ждут доклады экспертов, дискуссия о будущем стриминга и технобаттл между Я.Эфиром и Okko. По итогу баттла станет ясно, кто же круче транслирует спортивные события. В гостях у Яндекса — CTO популярных онлайн-кинотеатров и учёные. А модерировать баттл будет комментатор Василий Уткин.\n\nПринять участие: https://tprg.ru/VroX\n\nЭто #партнёрский пост"
    },
    {
        "id": 1686760,
        "likes": 197,
        "reposts": 24,
        "text": "Наверняка за последнее время вы видели десятки разных дипфейков. У нас в паблике мы публикуем их с хэштегом #дипфейк@tproger, можете глянуть.\n\nА как они делаются? Большинство из них создаётся с помощью инструмента DeepFaceLab.\n\nНа гитхабовской страничке проекта есть подробные примеры и гайды по использованию DeepFaceLab. Без проблем можете сгенерить дипфейк своими руками:\n\nhttps://github.com/iperov/DeepFaceLab\n\n#дипфейк@tproger #нейросети@tproger"
    },
    {
        "id": 1686725,
        "likes": 419,
        "reposts": 23,
        "text": "В статье рассказываем про основы регулярных выражений для новичков:\n\nhttps://tproger.ru/articles/regexp-for-beginners/\n\n#регулярки@tproger"
    },
    {
        "id": 1686695,
        "likes": 96,
        "reposts": 2,
        "text": "Энтузиаст научился управлять Марио с помощью реальных движений. Понадобились знания в OpenCV, Python и 4 часа свободного времени.\n\nЭто уже кстати не первая попытка управлять Марио необычным способом. Не так давно мы рассказывали о том, как парень научился играть в Марио [https://vk.com/wall-30666517_1623728|с помощью жестов].\n\n#opencv@tproger #марио@tproger"
    },
    {
        "id": 1686690,
        "likes": 21,
        "reposts": 2,
        "text": "Ближайшие события для айтишников:\n\n— Магистратура «Цифровые технологии в бизнесе» от МФТИ, бизнес-школы СКОЛКОВО и МТС \nРегистрация до 23 августа, Москва, https://bit.ly/323cDAn \n\nЗа 2 года выпускники получат 2 диплома, обретут глубокие технические знания и отработают их на практике в собственном проекте под руководством ментора. \n \n— Студенческое соревнование по кибербезопасности «Кибервызов: новый уровень» \nРегистрация до 28 августа, онлайн, https://tprg.ru/thM3 \n \nРешать задачи в 6 направлениях кибербезопасности приглашают студентов со всей России, а победители смогут попасть на образовательную программу в Сочи. \n \n— Вебинар «Простая и понятная производственная аналитика с дашбордом Winnum» \n25 августа, онлайн, https://tprg.ru/oaS1 \n \nНа вебинаре технический директор компании Winnum расскажет, что такое Dashboard и какие функциональные возможности он предоставляет, а также покажет сценарий создания и настройки на примере готовых объектов. \n \n— Вебинар «Производительность 1С на PostgreSQL в Яндекс.Облаке» \n27 августа, онлайн, https://tprg.ru/1aI2 \n \nРасскажут, как настроить PostgreSQL на Network SSD и Local SSD для повышения производительности, а также рассмотрят, как скорость работы, надежность и масштабируемость приложений связаны с размерами дисков. \n \n— Митап «Интерфейс в 1С» \n28 августа, онлайн, https://tprg.ru/CEsw \n \nОнлайн-митап, посвящённый возможностям настройки, повышению юзабилити интерфейса в 1С. Поговорят о проблемах интерефейса в 1С, настройке качественного интерфейса и последних изменениях и тенденциях. \n \n— Хакатон на Полярном круге 2.0 \nРегистрация до 31 августа, Салехард, https://tprg.ru/wbih \n \nЦель хакатона — сделать Ямало-Ненецкий автономный округ прогрессивным, безопасным и решить социальные проблемы местных жителей. Победители разделят призовой фонд в 450 000 рублей. Участие бесплатное, а организаторы компенсируют расходы на проезд. \n \n#ивенты@tproger"
    },
    {
        "id": 1686615,
        "likes": 548,
        "reposts": 23,
        "text": "Современный интернет не может существовать без алгоритмов хеширования. Но как они работают — для многих загадка и почти магия. \n \nРассказываем и показываем, как работает SHA-256 шаг за шагом:\n\nhttps://tproger.ru/translations/sha-2-step-by-step/\n\n#криптография@tproger"
    },
    {
        "id": 1686583,
        "likes": 618,
        "reposts": 70,
        "text": "Экстремальный SQL для самых маститых. Будьте уверены, после этих вопросов реальное собеседование покажется вам песней! \n \nUPDATE this_post SET description =\n\"Мы просто собрали 25 разных вопросов по SQL, которые часто встречаются на собеседованиях, и дали на них развёрнутые ответы.\"; \n \nhttps://tproger.ru/articles/sql-interview-questions/ \n \n#sql@tproger #собеседование@tproger"
    },
    {
        "id": 1686565,
        "likes": 56,
        "reposts": 4,
        "text": "Парочка статей на выходные:\n\n— Чем занимается «белый хакер»: https://tprg.ru/cnN5\n\n— Эксперты рассказывают о самых сложных алгоритмах в их работе: https://tprg.ru/7M6g\n\n#лучшеезанеделю@tproger"
    },
    {
        "id": 1686485,
        "likes": 130,
        "reposts": 2,
        "text": "Может, какой-то свой небольшой проект, а может и фриланс в качестве дополнительного заработка.\n\n#обсуждение@tproger"
    },
    {
        "id": 1686467,
        "likes": 85,
        "reposts": 1,
        "text": "МегаФон первым из мобильных операторов запустил продажу сим-карт в Яндекс.Лавке.\n\nТеперь можно получить сим-карту буквально за 15 минут, а чтобы она заработала, достаточно активировать её в приложении Мегафона и выбрать тариф. На выбор доступны любые тарифы, в том числе и тарифы из линейки #БезПереплат, которые позволяют переносить гигабайты и общаться в мессенджерах при нулевом балансе. \n\nЗащита от платных подписок уже включена во все тарифы, а на счёт сразу зачисляется 300 рублей — именно столько стоит сим-карта. Услуга пока доступна только в Москве и Московской области, но на следующей неделе она появится в Санкт-Петербурге, Ленинградской области и в Нижнем Новгороде.\n\nКстати, доставка сим-карты осуществляется бесконтактным способом.\n\nЭто #партнёрский пост"
    },
    {
        "id": 1686430,
        "likes": 148,
        "reposts": 9,
        "text": "Роборука от OpenAI и Shadow Robot Company таки собрала кубик Рубика, но в 8 из 10 случаев уронила его.\n\nВ прошлом году показали, как роборука Dactyl без труда вращает детский кубик, находя на нём нужный символ. Тогда многим показалось, что это революция в роботостроении, да и вообще восстание машин не за горами. Но спустя год стало понятно, что на деле ловкость роборуки слишком специфична, в 8 из 10 случаев она роняла кубик, а на её обучение ушло 10000 симулированых лет.\n\nДаже без учёта того, что рука подключена к мощной компьютерной системе, множеству камер и других датчиков, в таком виде её всё ещё сложно адаптировать для решения реальных задач. Это лишний раз доказывает, что реклама невероятных возможностей машинного обучения роботов не всегда правдива. Ну и как вы поняли, восстание машин пока откладывается.\n\n#hardware@tproger #технологии@tproger"
    },
    {
        "id": 1686401,
        "likes": 6,
        "reposts": 1,
        "text": "Онлайн-университет GeekBrains ищет преподавателей, авторов и ревьюеров.\n\nЕсли вы поняли, что готовы делиться опытом — присоединяйтесь к команде GeekBrains. Прямо сейчас они набирают более 30 преподавателей, авторов и ревьюеров в самых разных сферах: от Backend-разработчиков до Data Scientist-ов, от тестировщиков до специалистов по информационной безопасности.\n\nОсновные задачи:\n— преподаватели ведут онлайн-занятия по любимым темам,\n— авторы разрабатывают собственные программы,\n— ревьюеры дают обратную связь на практические работы студентов.\n\nГлавное:\n— опыт работы в сфере от 2 лет;\n— можно регулировать нагрузку и совмещать с основной работой;\n— опыт в образовании не важен;\n— получите доступ к курсам, мероприятиям и всей базе знаний GeekBrains.\n\nУзнать больше и откликнуться: https://tprg.ru/nXf9\n\nЭто #партнёрский пост"
    },
    {
        "id": 1686378,
        "likes": 172,
        "reposts": 13,
        "text": "Выгорание может коснуться каждого IT-специалиста. Иногда это просто отсутствие интереса к новому, что легко лечится шашлыками или поездкой к морю. Но порой это перерастает в страх от одной только мысли сесть за компьютер, от которого не так-то просто избавиться.\n\nОпытный разработчик рассказывает, как не доводить себя до такого состояния и что делать, если выгорание всё-таки пришло.\n\n#эксперты@tproger #работа@tproger"
    },
    {
        "id": 1686321,
        "likes": 105,
        "reposts": 4,
        "text": "Помните, как все ругали технологию, которую использовали для омоложения пожилых актёров в фильме «Ирландец»?\n\nЭнтузиасты взяли и сделали дипфейк, в котором постарались учесть критику зрителей. Как вам полученный результат?\n\n#дипфейк@tproger #нейросети@tproger"
    },
    {
        "id": 1686298,
        "likes": 116,
        "reposts": 8,
        "text": "Хинт для программистов: если зарегистрироваться на соревнования Huawei Honor Cup, которые проходят сейчас, то бесплатно получите доступ к онлайн-школе для участников. Можно прокачаться по разным навыкам и ещё, возможно, выиграть $10 000 в самом соревновании.\n\nРегистрация ещё открыта: https://tprg.ru/WCvN\n\nЭто #партнёрский пост"
    },
    {
        "id": 1686281,
        "likes": 23,
        "reposts": 3,
        "text": "Когда уже электронное голосование через интернет дойдёт до каждого избирателя? И дойдёт ли вообще?\n\nАвтор статьи разбирается с историей избирательных технологий, попытками цифровизации этой сферы и проблемами, с которыми приходится сталкиваться:\n\nhttps://tprg.ru/oqgj\n\n#технологии@tproger"
    },
    {
        "id": 1686230,
        "likes": 753,
        "reposts": 41,
        "text": "Приложение для просмотра погоды — не самый оригинальный, но всё равно вполне хороший пример приложения для обучения программированию.\n\nРекомендуем подборку из 8 API, которые можно использовать для создания таких приложений:\n\nhttps://tprg.ru/C67n\n\n#api@tproger"
    },
    {
        "id": 1686221,
        "likes": 4,
        "reposts": 0,
        "text": "Новая магистратура от МФТИ, бизнес-школы СКОЛКОВО и МТС \n \nСтудентов ждут: \n— глубокие технические знания; \n— работа над проектом под руководством менторов; \n— бюджетные места; \n— 2 года, 2 диплома. \n \nУспейте зарегистрироваться до 23 августа: https://bit.ly/323cDAn\n \nЭто #партнёрский пост"
    },
    {
        "id": 1686143,
        "likes": 497,
        "reposts": 25,
        "text": "Рассказываем, что делать, если вы решили освоить Python с нуля — что учить в первую очередь, где брать знания и что делать дальше:\n\nhttps://tproger.ru/curriculum/python-how-to-learn/\n\n#python@tproger"
    },
    {
        "id": 1686101,
        "likes": 110,
        "reposts": 2,
        "text": "Стэнфордские исследователи научились с помощью смартфона определять степень опьянения пользователя.\n\nВ чём суть исследования? Людей просили пить алкогольный напиток на протяжении 7 часов, периодически при этом делая 10 шагов вперёд и назад с телефоном в кармане. И на основе измерений ускорения и движения смартфона во время ходьбы получилось сделать выводы о степени опьянения участников эксперимента.\n\nГде видите применение такой технологии?\n\n#технологии@tproger"
    },
    {
        "id": 1686075,
        "likes": 201,
        "reposts": 12,
        "text": "Все говорят: «программист должен знать математику, алгоритмы и структуры данных, понимать работу компилятора». А ещё и принтер починить, конечно же.\n\nНо часто на практике эти знания не всегда нужны (кроме скилла починки принтера — он нужен всегда). Спросили у экспертов, какой самый сложный алгоритм им довелось использовать в реальной работе:\n\nhttps://tproger.ru/experts/the-most-complex-algorithm/\n\n#эксперты@tproger #алгоритмы@tproger"
    },
    {
        "id": 1686009,
        "likes": 187,
        "reposts": 6,
        "text": "Производитель лидаров RoboSense показал, как выглядит окружающий мир глазами беспилотников:\n\n#автопилот@tproger #технологии@tproger"
    },
    {
        "id": 1686005,
        "likes": 27,
        "reposts": 2,
        "text": "Врываетесь в обсуждения на Stack Overflow с лучшими практиками или объясняете начинающим в комментариях, где именно они неправы в своём «Hello, World!»? Может быть, даже раздумываете над тем, чтобы стать наставником?\n\nНаставники и выпускники Яндекс.Практикума рассказывают, зачем нужны менторы, в нашем новом материале. Почитайте и узнаете ответы на эти и другие вопросы:\n— где найти комьюнити, в котором можно делиться опытом;\n— что значит «помогать учиться»;\n— из чего складывается наставничество;\n— что нужно знать и уметь.\n\nВдруг как раз этого вам и не хватало для старта: https://tproger.ru/articles/sharing-knowledge/\n\nЭто #партнёрский пост"
    },
    {
        "id": 1685983,
        "likes": 51,
        "reposts": 1,
        "text": "Сколько стоит жизнь в Кремниевой долине? Сколько придётся потратить на оплату счетов и сколько денег останется в итоге, ведь область залива Сан-Франциско традиционно считается самым дорогим местом в США.\n\nРассказывает Senior Full Stack Engineer, работающий там в Cisco Systems:\n\nhttps://tprg.ru/2n9m\n\n#долина@tproger #финансы@tproger"
    },
    {
        "id": 1685960,
        "likes": 72,
        "reposts": 3,
        "text": "Чем занимается «белый хакер», какими инструментами «хакает», сколько зарабатывает и где находит заказы? Читайте о специалистах по поиску уязвимостей в нашей статье: \n \nhttps://tproger.ru/articles/who-are-the-white-hackers/ \n \n#безопасность@tproger #хакинг@tproger"
    },
    {
        "id": 1685932,
        "likes": 21,
        "reposts": 0,
        "text": "#вакансия@tproger #работа@tproger \nСанкт-Петербург, опыт от 3 лет\n\nNexign, ведущий поставщик систем поддержки бизнеса и платформ IoT для крупных операторов связи, ищет аналитика в команду проекта Universal financial monitor.\n\nАналитик мечты в команду UFM должен знать методики сбора и анализа требований, методологии анализа и моделирования бизнес-процессов (IDEF, EPC, BPMN, UML). Кроме того, нужно уметь проектировать схемы интеграции (API) и схем БД, проводить переговоры и совещания, эффективно презентовать свои идеи.\n\nИз плюшек можно выделить:\n— расширенный соцпакет (можно компенсировать расходы на спорт, отдых, книги и многое другое);\n— собственные центр обучения и мастер-классы;\n— терраса на крыше, спортзал и массажные кресла в офисе.\n\nБольше информации про задачи и преимущества: https://tprg.ru/jAvF"
    },
    {
        "id": 1685756,
        "likes": 482,
        "reposts": 28,
        "text": "Мы недавно [https://vk.com/wall-30666517_1685249|спрашивали] у вас, что должно быть у каждого программиста.\n\nСоставили топ из самых популярных и интересных версий:"
    },
    {
        "id": 1685747,
        "likes": 47,
        "reposts": 6,
        "text": "Karma Framework — это новая новая модель управления IT-процессами от «Ростелекома», которая учитывает разнообразие бизнеса, команд и потребности клиента.\n\nЧто принципиально нового в этом подходе?\n— KPI в цифрах не важны;\n— лояльность и отношение клиента как цель;\n— организация команд с учётом специфики продукта и заказчика;\n— возможность переключаться между методологиями разработки;\n— наличие объективной и субъективной оценки результата.\n\nПодробнее об управленческой системе «Ростелекома» читайте в статье: https://tprg.ru/qFjx\n\nЭто #партнёрский пост"
    },
    {
        "id": 1685718,
        "likes": 129,
        "reposts": 6,
        "text": "Как выглядел бы теннисный матч между Роджером Федерером и Сереной Уильямс? А между Федерером и... Федерером?\n\nТеперь есть возможность это увидеть: в Стенфорде сделали нейросеть, которая умеет генерить теннисные матчи. Причём можно не только смотреть, но и влиять на происходящее, меняя положение игроков на корте.\n\n#нейросети@tproger"
    },
    {
        "id": 1685670,
        "likes": 119,
        "reposts": 6,
        "text": "Сколько весит интернет? Не в байтах или битах, а прям физически, в граммах.\n\nАвтор статьи попытался разобраться: https://tprg.ru/iB3P\n\n#интернет@tproger"
    },
    {
        "id": 1685660,
        "likes": 117,
        "reposts": 8,
        "text": "Яндекс открыл регистрацию на чемпионат по программированию Yandex Cup.\n \nВ этот раз подготовили задачи по бэкенд- и фронтенд-разработке, машинному обучению, мобильной разработке, аналитике и спортивному программированию. Разработчики Яндекса придумали нестандартные, но приближённые к реальным, задачи — будет непросто, но интересно. Победители получат денежные призы.\n\nПроверьте свои силы: https://tprg.ru/Ydap\n\nЭто #партнёрский пост"
    },
    {
        "id": 1685603,
        "likes": 832,
        "reposts": 60,
        "text": "Забавный способ анимации изменения содержимого в урле.\n\nО том, как реализовать что-то похожее мы писали [https://vk.com/wall-183460226_1075|здесь] и [https://vk.com/wall-30666517_1648173|здесь].\n\n#веб@tproger #кек@tproger"
    },
    {
        "id": 1685594,
        "likes": 299,
        "reposts": 14,
        "text": "Зачем нужна статистика дата-сайентисту? Например, чтобы извлекать информацию из данных, узнавать их структуру и на основе полученной информации проводить дальнейший анализ.\n\nВ этой статье рассматриваем 5 базовых концепций статистики, которые полезно знать дата-сайентистам:\n\nhttps://tproger.ru/translations/statistics-for-data-scientists/\n\n#datascience@tproger #статистика@tproger"
    },
    {
        "id": 1685557,
        "likes": 186,
        "reposts": 14,
        "text": "ПО на Boeing до сих пор обновляют с помощью 3.5\" дискет.\n\nРечь про Boeing 747-400 — десятки этих самолётов всё ещё ежедневно совершают рейсы по всему миру. Авиалайнеры обычно недоступны для исследователей. Однако решение British Airways списать парк B747 дало возможность экспертам по информационной безопасности изучить самолёт изнутри:\n\nhttps://tprg.ru/o3Pw\n\nС помощью 3.5\" дискет в них раз в месяц обновляют информацию об аэропортах, траекториях полётов и взлётных полосах. К слову, Минобороны США прекратило использование дискет для координации ядерных сил страны только в октябре прошлого года, а на МКС их используют до сих пор."
    },
    {
        "id": 1685496,
        "likes": 91,
        "reposts": 8,
        "text": "Можно ли сделать игру с управлением при помощи улыбки? Легко. А с помощью крика? Проще простого.\n\nAndroid-программист рассказал о процессе разработки:\n\nhttps://tprg.ru/Fmoj\n\n#нейросети@tproger #gamedev@tproger"
    },
    {
        "id": 1685463,
        "likes": 210,
        "reposts": 11,
        "text": "Немецкий ютубер сделал синтезатор из сосисок и драм-машину из пива.\n\nДля этого он использовал MaKey MaKey, придуманный как раз для того, чтобы превратить в кнопки всё, что хоть немного проводит электрический ток. Паренёк назвал устройство Bockwurstklavier — в честь популярных в Германии свино-телячьих сосисок bockwurst.\n\nРанее благодаря этому устройству блогер создал драм-машину из пивных банок: https://tprg.ru/jtJb\n\nВместе с синтезатором из сосисок это должно выглядеть как идеальный уголок диджея для пивного бара.\n\n#diy@tproger"
    },
    {
        "id": 1685443,
        "likes": 83,
        "reposts": 5,
        "text": "Традиционная подборка материалов на выходные:\n\n— Что должен знать Junior-разработчик: https://tprg.ru/vFEV\n\n— Как разработчики игр делают картинку приятнее и какой тип сглаживания выбрать: https://tprg.ru/TRJz\n\n— Как с электронной аудиокассеты запускать игры на 8-битном ПК: https://tprg.ru/Iabv\n\n#лучшеезанеделю@tproger"
    },
    {
        "id": 1685249,
        "likes": 67,
        "reposts": 8,
        "text": "Накидывайте свои варианты, а через несколько дней подведём итоги и составим топ из ваших ответов.\n\nНапример, что это может быть? Интернет, стаканчик для смузи, книга «Чистый код» и т.д."
    },
    {
        "id": 1685230,
        "likes": 187,
        "reposts": 1,
        "text": "Олды тут? Одному энтузиасту надоело искать кассеты с ПО для своего старенького 8-битного компьютера ZX Spectrum. Ему в голову пришла идея имитировать сигнал кассеты с помощью Arduino Nano, а сами данные хранить на карте памяти. Вот что получилось: \n \nhttps://tproger.ru/articles/arduino-cassette-for-spectrum/\n\n#arduino@tproger"
    },
    {
        "id": 1685207,
        "likes": 16,
        "reposts": 1,
        "text": "12 и 13 сентября социологи, юристы, ИБ-специалисты, разработчики и дизайнеры разработают IT-решения, которые направлены на защиту прав и реализацию интересов граждан в цифровой среде: https://tprg.ru/Y4Ul\n\nАвторы лучших проектов смогут развить их в ходе буткемпа и разделят призовой фонд в 1 500 000 ₽. \n\nЭто #партнёрский пост"
    },
    {
        "id": 1685163,
        "likes": 99,
        "reposts": 1,
        "text": "Студенты колледжа в Лондоне разработали устройство для авторизации по отпечатку рта.\n\nУстройство называется Stealth. Его нужно вставлять в рот, где оно сканирует складки и морщины на нёбе. Задумка в том, что отпечатки нёба индивидуальны. Но в отличие от отпечатка пальца или лица, отпечаток нёба гораздо тяжелее подделать.\n\nhttps://tprg.ru/QURx\n\nПока у ребят есть только патент на дизайн устройства, а над прототипом они ещё работают. Но когда-то мы и Face ID с трудом представляли.\n\n#hardware@tproger #технологии@tproger"
    },
    {
        "id": 1685112,
        "likes": 887,
        "reposts": 53,
        "text": "Большой гайд от Microsoft с рекомендациями по созданию качественного API:\n\nhttps://docs.microsoft.com/en-us/azure/architecture/best-practices/api-design\n\n#microsoft@tproger #api@tproger"
    },
    {
        "id": 1685103,
        "likes": 85,
        "reposts": 4,
        "text": "Онлайн-хакатон Южного IT-хаба России\n\n21–23 августа участники будут решать на выбор 1 из 10 представленных кейсов от:\n— Почты России;\n— ПАО «Ростелеком»;\n— АНО «Агентство инноваций Ростовской области»;\n— Госкорпорации «Росатом»;\n— ПАО «Россети»;\n— РИНХ;\n— администрации Новороссийска;\n— Министерства ЖКХ Ростовской области;\n— Фонда содействия развитию современных информационных технологий и цифровизации экономики «Атом»;\n— аналитической платформы Yoloco.\n\nПризовой фонд хакатона составит 3 000 000 ₽.\n\nУспейте зарегистрироваться до 16 августа, соберите команду и создайте своё крутое IT-решение: https://tprg.ru/0JS8\n\nЭто #партнёрский пост"
    },
    {
        "id": 1685097,
        "likes": 94,
        "reposts": 11,
        "text": "В серии видеоуроков автор рассказывает про автоматизацию проектов на базе Unreal Engine с использованием Jenkins: автоматическая сборка исходников, клиента, сервера, unit тесты.\n \nВсего 3 видеоурока:\n1. Введение.\n2. Сборка движка из исходников с использованием Jenkins.\n3. Сборка blueprint проекта с использованием Jenkins.\n\nВидео в альбоме — https://tprg.ru/zScP\n \n#gamedev@tproger #unrealengine@tproger"
    },
    {
        "id": 1685076,
        "likes": 115,
        "reposts": 5,
        "text": "Замечали ли вы в играх, что объекты на большом расстоянии становятся сильно пиксельными? А бывало, когда на границе плоскости пиксельная лесенка попросту портит весь кадр? Вероятно, в настройках графики у вас не включено сглаживание.\n\nКакие типы сглаживаний существуют? Как они работают? Какой вариант лучше выбрать? Всё это рассказываем в сегодняшней статье:\n\nhttps://tproger.ru/articles/anti-aliasing-in-games/\n\n#gamedev@tproger"
    },
    {
        "id": 1685049,
        "likes": 21,
        "reposts": 1,
        "text": "Ближайшие события для айтишников:\n\n— Обучение Java-разработке с оплатой после трудоустройства\nСтарт 31 августа, онлайн, https://tprg.ru/oDdx\n\nДо 21 августа можно подать заявку на новый набор программы по Java-разработке от проекта Java Mentor. Главная особенность — обучение абсолютно бесплатное, оплата только после того, как найдете первую работу в Москве.\n\n— Митап «Оценка компетенций специалистов»\n14 августа, онлайн, https://tprg.ru/WJSg\n\nМитап, посвящённый способам и инструментам эффективной и качественной оценки навыков сотрудников. Поговорят о инструментах оценки, методах и способах тестирования компетенций, а также моделях, матрицах, индикаторах компетенций.\n\n— Хакатон Tele2 Solutions Days\n21–23 августа, онлайн, https://tprg.ru/4opB\n\nОнлайн-хакатон, организованный Tele2 совместно с «Лигой Цифровой Экономики» и e-Legion. Общий призовой фонд составит 500 000 рублей, а некоторые участники смогут получить приглашение на работу в Tele2 и «Лигу Цифровой экономики».\n\n— Конференция AI-MEN 2020\n25 августа, онлайн, https://tprg.ru/aPZW\n\nМеждународная онлайн-конференция по использованию технологий искусственного интеллекта, машинного обучения и Data Science. В программе доклады спикеров из Беларуси, России и США.\n\n#ивенты@tproger"
    },
    {
        "id": 1685000,
        "likes": 708,
        "reposts": 34,
        "text": "Просто забавная реклама про технологии от HP:"
    },
    {
        "id": 1684986,
        "likes": 20,
        "reposts": 2,
        "text": "Актуальные вакансии для разработчиков:\n\n— Backend Developer (PHP/Go) в Xsolla: https://tprg.ru/uWj6\nУдалённо, опыт от 3 лет\n\n— Full-Stack Разработчик в «Турбоподготовка»: https://tprg.ru/ywAI\nМосква, опыт от 1 года, от 120 000 ₽\n\n— Программист-разработчик (Java) в Sportmaster Lab: https://tprg.ru/GsF9\nЛипецк, до 150 000 ₽\n\n— Full-Stack JavaScript Developer в ООО МКК «Правовой Капитал»: https://tprg.ru/Pih6\nЕкатеринбург (можно удалённо), опыт от 1 года, от 50 000 ₽\n\n#вакансии@tproger #работа@tproger"
    },
    {
        "id": 1684952,
        "likes": 206,
        "reposts": 13,
        "text": "Как работает ИИ в играх? Часто его реализовывают при помощи алгоритма конечного автомата, получая аккуратное решение без написания громоздкого и сложного кода.\n\nВ этой статье рассматриваем теорию этого алгоритма и его реализацию:\n\nhttps://tproger.ru/translations/finite-state-machines-theory-and-implementation/\n\n#алгоритмы@tproger #gamedev@tproger #ии@tproger"
    },
    {
        "id": 1684846,
        "likes": 346,
        "reposts": 17,
        "text": "Пошаговое руководство к созданию языка программирования с кучей реализаций на разных языках:\n\nhttps://github.com/kanaka/mal/blob/master/process/guide.md"
    },
    {
        "id": 1684838,
        "likes": 18,
        "reposts": 1,
        "text": "Проект Java Mentor запускает новый набор на учебную программу по Java-разработке на современном стеке. Главное условие — это абсолютно бесплатно, пока вы не найдёте первую работу. За свою работу организаторы просят процент от зарплаты разработчика.\n\nЗа 6 месяцев изучите все необходимые инструменты и технологии для трудоустройства и создадите полноценный коммерческий веб-проект. Преподаватели курса — опытные практикующие специалисты, которые будут заниматься с вами индивидуально и делать жесткое ревью знаний и кода на каждом этапе. Они не только научат разрабатывать современные веб-приложения, но и подготовят к техническим собеседованиям и на протяжении двух лет будут оказывать профессиональную поддержку и помогать в карьерном развитии.\n\nПодробнее: https://tprg.ru/Xj6w\n\nЭто #партнёрский пост"
    },
    {
        "id": 1684794,
        "likes": 136,
        "reposts": 7,
        "text": "Google превращает смартфоны с Android в сеть для обнаружения землетрясений и раннего оповещения о них.\n\nОказалось, что обнаружить колебания земной коры позволяет и обычный акселерометр, который есть во всех смартфонах. Работая вместе, смартфоны способны сформировать сеть обнаружения землетрясений.\n\nПри подозрении на землетрясение, пользователей попросят подтвердить эту информацию в поисковой выдаче. А уже при уверенности в землетрясении, Google начнёт рассылку предупреждений и краткой инструкции к действию. Систему пока обкатывают в Калифорнии, но уже в следующем году планируют запустить и в других штатах и странах.\n\n#google@tproger"
    },
    {
        "id": 1684770,
        "likes": 77,
        "reposts": 3,
        "text": "В прошивке Xiaomi Mi 9T найдена уязвимость, позволяющая просматривать изображение с подэкранной камеры сканера отпечатков пальцев.\n\nЮзер Reddit'а рассказал, что получил доступ к расплывчатому изображению (0.5 Mpx, 3 fps) с миникамеры, зайдя внутрь отладочного приложения для сканера отпечатков. На видео видно, как выглядит «фича» и как её включить.\n\nЕсть владельцы этого смартфона, удалось повторить?"
    },
    {
        "id": 1684744,
        "likes": 364,
        "reposts": 21,
        "text": "Зачем разработчики ведут блоги?\n\nЧтобы стать более ценным специалистом и найти работу? Или прокачать личный бренд? Может, просто ради кайфа?\n\nРазработчик, который ведёт популярный русскоязычный блог «Вастрик», попытался разобраться в этом вопросе и дал несколько советов тем, кто всё же решился вести блог:\n\nhttps://tprg.ru/x3pl"
    },
    {
        "id": 1684694,
        "likes": 151,
        "reposts": 9,
        "text": "Вот сейчас модно использовать бессерверные вычисления, облачную инфраструктуру и вот это вот всё. Не паришься про масштабируемость, а платишь только за используемые ресурсы. А если кто-то специально заходит на твой сайт, чтобы ты попал на деньги? Ну, скажем, миллион ботов каждую секунду. А потом приходит счёт на миллион, но уже долларов. Что делать? \n\nАвтор этой статьи рассказал, как минимизировать ущерб от DDoS-атак на AWS Lambdas: https://luminousmen.com/post/aws-lambda-abuse\n\nTL;DR:\n— убедиться, что код не зависает на неправильных данных;\n— оповещать о превышении биллинга;\n— concurrency level для каждой функции;\n— использовать SQS в качестве брокера для функции Lambda для обработки нескольких событий одновременно;\n— использовать CDN (например, CloudFront) или AWS WAF;\n— требовать API ключ для доступа к API Gateway;\n— присмотреться к «Token Bucket» моделям.\n\n#облака@tproger #безопасность@tproger #aws@tproger"
    },
    {
        "id": 1684664,
        "likes": 72,
        "reposts": 2,
        "text": "Кастдев, А/В-тесты, CRR и MVP — знакомые слова? Проверьте свои знания в запуске стартапов вместе с Тирексом в новом тесте от Tproger и Selectel и разберитесь во всех тонкостях и подводных камнях продвижения продукта. Это ведь не только про разработку:\n\nhttps://tproger.ru/quiz/startup-from-selectel/"
    },
    {
        "id": 1684648,
        "likes": 358,
        "reposts": 37,
        "text": "Крупные IT-компании предлагают множество образовательных услуг для студентов, преподавателей и учебных заведений — курсы, вебинары, скидки на сервисы и бесплатный софт.\n\nВ этой серии статей собраны основные такие плюшки:\n— от Google: https://tprg.ru/DTZR\n— от Microsoft: https://tprg.ru/mheJ\n— от Amazon: https://tprg.ru/zFRK\n— от Alibaba, JetBrains, GitHub и других компаний: https://tprg.ru/27Xq\n\n#google@tproger #microsoft@tproger #amazon@tproger"
    },
    {
        "id": 1684560,
        "likes": 352,
        "reposts": 15,
        "text": "Как написать бота, которого нельзя будет обыграть в «крестики-нолики»?\n\nРазбираемся с этим алгоритмом в статье:\n\nhttps://tproger.ru/translations/tic-tac-toe-minimax/\n\n#javascript@tproger #алгоритмы@tproger"
    },
    {
        "id": 1684523,
        "likes": 275,
        "reposts": 19,
        "text": "Как найти минимальную глубину бинарного дерева? А как посчитать в нём все листья? А как преобразовать бинарное дерево в двоичное дерево поиска?\n\nДержите подборку из практических 17 вопросов по теме бинарных деревьев с предлагаемыми решениями:\n\nhttps://tprg.ru/na7g\n\n#алгоритмы@tproger"
    },
    {
        "id": 1684394,
        "likes": 929,
        "reposts": 23,
        "text": "Современные дети во дворе играют в айтишников, а в кого в детстве играли вы?"
    },
    {
        "id": 1684278,
        "likes": 136,
        "reposts": 13,
        "text": "Форматирование кода — одна из важных составляющих понятия «чистый код». Следование общим правилам помогает работать в команде и не спорить по мелочам.\n\nНапример, у Google есть большой гайд по написанию кода на Java. В этой статье найдёте его перевод на русский:\n\nhttps://tprg.ru/L6cB\n\n#java@tproger #google@tproger #чистыйкод@tproger"
    },
    {
        "id": 1684249,
        "likes": 462,
        "reposts": 42,
        "text": "Что должен знать Junior сегодня, завышена ли планка требований и какого джуна на самом деле ищут компании? Мы разобрали 17 вопросов с собеседований, которые наглядно иллюстрируют, каким должен быть современный Junior-разработчик: \n \nhttps://tproger.ru/articles/junior-developer-should-know/ \n \n#советы@tproger #собеседование@tproger"
    },
    {
        "id": 1684233,
        "likes": 31,
        "reposts": 3,
        "text": "Парочка материалов от Типичного на выходные:\n\n— Кто такой DevOps-инженер и как им стать: https://tprg.ru/8Gdb\n\n— Что такое тендеры и как IT-компаниям с ними работать: https://tprg.ru/6U4p\n\n#лучшеезанеделю@tproger"
    },
    {
        "id": 1684034,
        "likes": 63,
        "reposts": 6,
        "text": "Если работаете над каким-то своим проектом, то это тоже считается.\n\n#обсуждение@tproger"
    },
    {
        "id": 1683998,
        "likes": 292,
        "reposts": 46,
        "text": "Подборка туториалов по разработке проектов на различных языках программирования — текстовый редактор на C++, HTTP-сервер на Java, todo-list на Python и много другое:\n\nhttps://github.com/tuvtran/project-based-learning\n\n#python@tproger #cpp@tproger #java@tproger"
    },
    {
        "id": 1683985,
        "likes": 92,
        "reposts": 3,
        "text": "Разработчик из Киева в 2016 году решился и переехал-таки вместе с семьёй на работу в Мюнхен.\n\nВ статье он подробно рассказал, почему всё-таки решил переехать, почему выбрал именно Мюнхен, а также поведал много-много нюансов о жизни и работе в Германии. \n\n#мотивация@tproger"
    },
    {
        "id": 1683929,
        "likes": 317,
        "reposts": 22,
        "text": "Подборка гаджетов, которые никогда не выйдут в реальной жизни.\n\nЕщё больше концептов — по ссылке: https://tprg.ru/exKA\n\n#hardware@tproger #кек@tproger"
    },
    {
        "id": 1683908,
        "likes": 24,
        "reposts": 1,
        "text": "Загляни в мир белого хакинга и освой Java-разработку на трёхдневном онлайн-интенсиве! Будем разбираться в коде сразу на практике и напишем программу для мониторинга активности рабочего стола.\n\nЗанятия бесплатные: ⏩ https://vk.cc/axNNPS.\nКоличество мест ограничено!\n\nПочему изучение Java — отличный выбор?\n\n✔ Это объектно ориентированный язык. На нём создаются модульные программы, исходный код которых можно использовать многократно.\n✔ Написанные на Java приложения запускаются на разных ОС.\n✔ 3 млрд устройств работают на Java, в том числе Android.\n\nИнтенсив ведёт Даниил Пилипенко, директор центра SymbioWay, специалист с 14-летним опытом в коммерческой разработке.\n\n🎁 В конце интенсива всех участников ждут подарки от Skillbox и издательства «МИФ»!"
    },
    {
        "id": 1683882,
        "likes": 23,
        "reposts": 0,
        "text": "Сокращённая ссылка влияет на ваше желание перейти по ней?\n\nНапример, у нас есть специальный сокращатель tprg.ru. С его помощью мы иногда делаем длиннющие ссылки короткими и аккуратными. Например: \n \nСсылка на статью про сисадминов: https://tproger.ru/articles/sysadmin-development/ \n \nСокращённая ссылка на статью про сисадминов: https://tprg.ru/i9Vd"
    },
    {
        "id": 1683828,
        "likes": 220,
        "reposts": 19,
        "text": "Университет Иннополис выложил в открытый доступ симулятор беспилотников.\n\nС его помощью можно на ранних этапах избежать множества фатальных ошибок и делать настоящие беспилотники безопаснее. Симулятор умеет имитировать движение трафика и пешеходов, необходимые датчики и сенсоры (радар, лидар, камеры, GPS, IMU).\n\nИсходники симулятора на гитхабе: https://github.com/inno-robolab/InnoSimulator\n\n#ии@tproger #иннополис@tproger"
    },
    {
        "id": 1683814,
        "likes": 520,
        "reposts": 67,
        "text": "OAuth — протокол авторизации, позволяющий выдать одному сервису права на доступ к ресурсам пользователя на другом сервисе. Например, когда вы где-нибудь авторизуетесь с помощью вашего аккаунта в Google, используется OAuth.\n\nВ этой большой шпаргалке подробно расписан принцип работы протокола.\n\nСсылка на оригинал в отличном качестве: https://tprg.ru/SvV4\n\n#безопасность@tproger #oauth@tproger #шпаргалка@tproger"
    },
    {
        "id": 1683741,
        "likes": 120,
        "reposts": 6,
        "text": "Забавную аудио-капчу можно пройти на сайте Audiotool — слушаете небольшой отрывок аудио, а затем выбираете из предложенных иконок, что именно вы слышали.\n\nПопробовать самому можно тут: https://www.audiotool.com/users/captcha\n\n#безопасность@tproger"
    },
    {
        "id": 1683711,
        "likes": 358,
        "reposts": 8,
        "text": "Ещё одна новость из [https://vk.com/wall-30666517_1683679|Новой Зеландии]: там правительство объявило о создании Хартии Алгоритмов.\n\nЭто значит, что теперь любые алгоритмы, которые используются правительством страны, должны стать открытыми. Будь то алгоритм расчёта пенсии или алгоритм переключения светофоров.\n\nВозможно, благодаря движению в таком направлении мы когда-нибудь наконец узнаем, как работает алгоритм показа рекламы от Google или алгоритмическая лента ВКонтакте.\n\n#алгоритмы@tproger"
    },
    {
        "id": 1683679,
        "likes": 154,
        "reposts": 12,
        "text": "В Новой Зеландии разработали прототип системы беспроводной передачи энергии.\n\nПодробностей о принципе действия пока почти нет. В компании Emrod заявляют, что принципиальных ограничений на объёмы передаваемой энергии у системы нет, а расстояние ограничено только дальностью прямой видимости — нужно лишь расположить передающую и принимающую антенны друг напротив друга и можно работать.\n\nЕсть перспективы у такой технологии, как считаете?\n\n#технологии@tproger"
    },
    {
        "id": 1683620,
        "likes": 262,
        "reposts": 11,
        "text": "Интересный шейдер для Blender для разработчиков игр или каких-то других визуальных штук — он может эмулировать картон, причём отдельно можно настраивать разную степень потёртости этого картона:\n\nhttps://blendermarket.com/products/cardboard\n\n#gamedev@tproger"
    },
    {
        "id": 1683617,
        "likes": 16,
        "reposts": 0,
        "text": "С середины августа по середину ноября пройдёт сразу 8 командных хакатонов в ключевых региональных IT-хабах страны.\n\nВ каждом регионе планирует принять участие до 280 команд, а общий призовой фонд этапа составит 24 000 000 ₽.\n\nВыбирайте любой понравившийся хакатон, регистрируйтесь и вступайте в борьбу за приз: https://tprg.ru/leadersofdigital\n\nЭто #партнёрский пост"
    },
    {
        "id": 1683596,
        "likes": 113,
        "reposts": 4,
        "text": "Помните, как недавно все обсуждали, что студия Лебедева год [https://vk.com/wall-30666517_1675732|использовала] нейросеть, выдавая её за реального дизайнера?\n\nТак вот, ребята с Хабра пообщались с арт-директором и технологом студии Лебедева. Спросили, действительно ли существует эта нейросеть или это всё фейк ради хайпа, как это всё устроено и вымрут ли дизайнеры в ближайшем будущем.\n\nПо ссылке — подкаст и его лонгрид-расшифровка: https://tprg.ru/SfWX\n\n#нейросети@tproger #дизайн@tproger"
    },
    {
        "id": 1683584,
        "likes": 177,
        "reposts": 7,
        "text": "Вышло обновление стабильной ветки ядра Linux — до версии 5.8. Линус Торвальдс назвал его крупнейшим в истории. Всего в новую версию принято 17,6 тысяч исправлений от 2 тысяч разработчиков, затронувших 20% всех файлов в репозитории. \n\nИз самого примечательного — в Linux впервые в истории добавили поддержку российского процессора – Baikal T1.\n\nС полным списком изменений можно ознакомиться на официальном сайте: https://kernelnewbies.org/Linux_5.8\n\n#linux@tproger"
    },
    {
        "id": 1683557,
        "likes": 325,
        "reposts": 16,
        "text": "Вам кажется, что ваши достижения — результат везения? А все вокруг гораздо круче вас и вот-вот это поймут? И вы недостойны занимаемой должности?\n\nЕсли вы 3 раза кивнули, то, скорее всего, у вас есть синдром самозванца. Среди программистов это довольно популярная штука.\n\nВ статье читайте, откуда этот не самый приятный синдром берётся и что с ним делать:\n\nhttps://tprg.ru/3c4V\n\n#советы@tproger"
    },
    {
        "id": 1683541,
        "likes": 26,
        "reposts": 3,
        "text": "Хочешь попасть в IT? Участвуй в интенсиве по Data Science и познакомься с основами анализа данных и технологиями машинного обучения. \n\nСсылка для бесплатной регистрации: 🔜 https://vk.cc/axCw5f.\n\n✔ Ты узнаешь, какие инструменты и алгоритмы используют специалисты. \n✔ Познакомишься с основами языка программирования Python.\n✔ Научишься грамотно выгружать и визуализировать данные.\n✔ Создашь модель машинного обучения, предсказывающую курс доллара.\n✔ Узнаешь, как оценивать качество модели.\n\n💣 Попробуй себя в роли специалиста по Data Science на мастер-классах от гуру в сфере машинного обучения Михаила Овчинникова и убедись, что эта профессия вполне доступна!"
    },
    {
        "id": 1683525,
        "likes": 112,
        "reposts": 3,
        "text": "С помощью исходников, которые выложены в этом репозитории, вы сможете сгенерировать танцы для выбранной песни:\n\nhttps://github.com/purvaten/feel-the-music\n\nНо в качестве результата работы алгоритма предлагаем посмотреть не на скучные примеры в репозитории, а на видос, который сгенерил автор канала Neural Shit (с любовью к оригиналу, чего уж):\n\n#нейросети@tproger #ии@tproger"
    },
    {
        "id": 1683507,
        "likes": 84,
        "reposts": 7,
        "text": "GitHub выложил в публичный доступ свою «дорожную карту», на которой можно посмотреть, когда появятся те или иные фичи: \n\nhttps://github.com/github/roadmap/projects/1\n\n#github@tproger"
    },
    {
        "id": 1683494,
        "likes": 161,
        "reposts": 18,
        "text": "Как работает алгоритм хэширования SHA-2? \n\nРазбор шаг за шагом в этой статье: https://tprg.ru/3vIx\n\n#шифрование@tproger #алгоритмы@tproger"
    },
    {
        "id": 1683490,
        "likes": 8,
        "reposts": 0,
        "text": "Интересуетесь облачными технологиями и хотите профессионально развиваться в этой области IT?\n\n1 августа стартовали ежегодные Евразийские соревнования в сфере ИКТ Huawei Honor Cup 2020, в которых у вас есть возможность проявить себя.\n\nЧто получат победители в номинации Cloud?\n— $10 000 за первое место,\n— новейший флагманский гаджет Huawei за второе место,\n— новейший флагманский гаджет Honor за третье место.\n\nКто может принимать участие?\nСтуденты, аспиранты или выпускники 2020, проживающие на территории Евразии, в возрасте от 18 до 28 лет.\n\nРегистрируйтесь здесь: https://tprg.ru/2Ssi\n\nЭто #партнёрский пост"
    },
    {
        "id": 1683446,
        "likes": 81,
        "reposts": 2,
        "text": "[https://vk.com/wall-30666517_1674257|Продолжаем] рассказывать о симпатичных миниатюрных макетах парня-энтузиаста. В этот раз он сделал терминал HP264X в масштабе 1:10. А работать экран заставил при помощи Raspberry Pi.\n\nТакие использовались в 70-х с миникомпьютерами серий HP1000 и HP3000.\n\n#diy@tproger #hardware@tproger"
    },
    {
        "id": 1683430,
        "likes": 90,
        "reposts": 5,
        "text": "DevOps-инженер: что за зверь, чем занимается и как стать таким же крутым? В этой статье мы собрали ответы на часто задаваемые вопросы о DevOps, а в конце — бонусный гайд: \n \nhttps://tproger.ru/articles/devops-engineer/ \n \n#devops@tproger"
    },
    {
        "id": 1683414,
        "likes": 240,
        "reposts": 14,
        "text": "Python не идеален — даже в стандартных библиотеках могут быть встроены некачественные методы, которые приведут к ошибкам.\n\nВ этой статье рассматриваем наиболее частые ошибки безопасности, допускаемые при разработке приложений на Python:\n\nhttps://tproger.ru/translations/python-security-troubles/\n\n#python@tproger #безопасность@tproger"
    },
    {
        "id": 1683372,
        "likes": 35,
        "reposts": 4,
        "text": "Могут ли IT-компании работать на государство без риска погрязнуть в бумажной бюрократии? \n\nTLDR: такой риск всегда есть, при этом участвовать в госзакупках — один из способов получить крупного клиента. \n\nРассказываем, как устроены тендеры, что может пойти не так и у кого больше шансов на победу: https://tproger.ru/articles/it-tenders/ \n\nВ статье найдёте алгоритм по участию, список необходимых документов и кейсы от компаний."
    },
    {
        "id": 1683354,
        "likes": 83,
        "reposts": 7,
        "text": "Подборка из 4-х материалов для продуктивных выходных:\n\n— Как программисту выделить время на самообучение: https://tprg.ru/zTdv\n\n— Тест, проверяющий насколько хорошо вы знаете IT сленг: https://tprg.ru/1Ipf\n\n— Java vs Kotlin для Android-разработки. 16 ответов «за» и «против»: https://tprg.ru/h2XB\n\n— Куда развиваться сисадмину: https://tprg.ru/i9Vd\n\n#лучшеезанеделю@tproger"
    },
    {
        "id": 1683327,
        "likes": 264,
        "reposts": 14,
        "text": "Сегодня, 1 августа, отмечается День святого Нуба.\n\nТ.к. ни один нуб точно не знает, когда точно придумали отмечать этот праздник, он отмечается аж четыре раза в год: 4 января, 23 марта, 1 августа и 12 сентября.\n\nПоэтому в любой из этих четырёх дней позволяется с чистой совестью вести себя, как полный нуб. Поэтому никак себя сегодня не ограничивайте."
    },
    {
        "id": 1683270,
        "likes": 89,
        "reposts": 5,
        "text": "В Tproger мы используем собственный аналитический инструмент в дополнение к традиционным Яндекс.Метрике и Google Analytics. Реализован он на базе ClickHouse и сервисов Яндекс.Облака.\n\nНаш дата инженер поделился опытом создания и развёртывания трекера событий и рассказал, какие задачи потребуется решать тем, кто захочет повторить наш путь, и зачем разрабатывать своё решение:\n\nhttps://tproger.ru/articles/tproger-tracker-yandex-cloud/\n\n#аналитика@tproger"
    },
    {
        "id": 1683253,
        "likes": 100,
        "reposts": 1,
        "text": "Qiwi разработала платформу Leak-Search для поиска утечек исходных кодов компаний: https://leak-search.com/\n\nРаботает всё это, естественно, с помощью ИИ. Leak-Search автоматически сканирует публичные репозитории и оповещает владельца, если нашёл утечку. А владелец уже самостоятельно должен будет разобраться в ситуации. \n\n#безопасность@tproger #ии@tproger"
    },
    {
        "id": 1683223,
        "likes": 241,
        "reposts": 18,
        "text": "Сегодня, в последнюю пятницу июля, отмечается день системного администратора, с чем мы каждого сисадмина и поздравляем!\n\nПо такому поводу в нашем новом материале разбираемся, за что благодарить сисадминов, как развитие IT влияет на их роль, пора ли хоронить профессию и в каком направлении они могут развиваться:\n\nhttps://tproger.ru/articles/sysadmin-development/\n\n#sysadmin@tproger"
    },
    {
        "id": 1683215,
        "likes": 48,
        "reposts": 0,
        "text": "Карантин хакатону не помеха! Ребята из BrainZ провели свой онлайн-хакатон с мафией и промокодами на пиццу. YoHack, который проходил в Zoom, — это 80 часов кодинга, афтепати, шесть прикольных комнат в онлайн-баре, фотограф-скринер и полиция скуки на страже котиков.\n\nОб организации крутого мероприятия, итогах и победителях читайте в статье: https://tprg.ru/VlGC"
    },
    {
        "id": 1683165,
        "likes": 863,
        "reposts": 42,
        "text": "Когда не только программист запутался в своём коде, но и инженер, который делал хардварную часть проекта:\n\n#hardware@tproger #кек@tproger"
    },
    {
        "id": 1683155,
        "likes": 34,
        "reposts": 1,
        "text": "За ответы на вопросы об IT-сфере можно выиграть iPhone 11, подписку на софт JetBrains и другие крутые призы.\n\nАналитики из /Data проводят опрос IT-специалистов со всего мира, чтобы понять тенденции и перспективы сферы в новом году. Расскажите о предпочтениях в технологиях, удалёнке и видеоконференциях и получите шанс выиграть подарков на 15 000 баксов:\n\nhttps://tprg.ru/sfEK\n\nЭто #партнёрский пост"
    },
    {
        "id": 1683134,
        "likes": 215,
        "reposts": 25,
        "text": "Чтобы при использовании регулярных выражений, у вас не появилась вторая проблема, важно быть готовым к их применению.\n\nРекомендуем сайт, где можно потыкать регулярки и попрактиковаться решать с их помощью задачи:\n\nhttps://regexone.com/\n\n#регулярки@tproger"
    },
    {
        "id": 1683129,
        "likes": 7,
        "reposts": 0,
        "text": "Актуальные вакансии для разработчиков:\n\n— Golang Developer в Xsolla: https://tprg.ru/QWUG\nУдалённо, опыт от 2 лет\n\n— Backend-разработчик (Python, Django) в Infatica: https://tprg.ru/tAkj\nУдалённо, опыт от 2 лет, 120 000 – 150 000 ₽\n\n— Middle Java Developer в L2U: https://tprg.ru/FX0I\nНовосибирск (можно удалённо), опыт от 3 лет\n\n— Frontend Developer (React) в Xsolla: https://tprg.ru/Hytq\nУдалённо, опыт от 2 лет, 150 000 ₽\n\n#вакансии@tproger #работа@tproger"
    },
    {
        "id": 1683104,
        "likes": 64,
        "reposts": 2,
        "text": "Выбор места учёбы — дело ответственное, очень не хочется ошибиться. В этом здорово могут помочь истории реальных людей, которые рассказывают о своём опыте. Вот одна из таких историй.\n\nДевушка закончила бакалавриат в питерском СПбГУ, а в магистратуру по специальности Computer Science решила поступать в Эстонии. О том, как готовилась к поступлению, как переезжала в другую страну и какие впечатления от учёбы остались — рассказывает в статье:\n\nhttps://tprg.ru/UT1q\n\n#образование@tproger"
    },
    {
        "id": 1683031,
        "likes": 492,
        "reposts": 28,
        "text": "Хорош тот программист, кто в курсе современных технологий и может постоянно самообучаться. Но как и когда это делать, если после рабочего дня уже нет сил на учёбу? \n\nСобрали советы экспертов, которые помогут выделить время на самообучение, чтобы ещё и на отдых оставалось:\n\nhttps://tproger.ru/experts/self-education-with-fulltime-job/\n\n#эксперты@tproger #советы@tproger"
    },
    {
        "id": 1683010,
        "likes": 92,
        "reposts": 2,
        "text": "На сколько чашек кофе вы разбираетесь в Java?\n\nПройдите квиз от Tproger и МТС из 11 задач, которые могут попасться вам на собеседовании на позицию Middle Java Developer, и проверьте себя:\n\nhttps://tproger.ru/quiz/java-mts/\n\nЭто #партнёрский пост"
    },
    {
        "id": 1682994,
        "likes": 421,
        "reposts": 10,
        "text": ""
    },
    {
        "id": 1682982,
        "likes": 124,
        "reposts": 4,
        "text": "Google планирует проложить новый волоконно-оптический кабель по дну Атлантического океана, чтобы улучшить качество связи.\n\nКабель пройдёт от Нью-Йорка до города Буде в Великобритании (6 250 км) и Бильбао в Испании (6 300 км). По словам компании, этот кабель станет одним из первых с 2003 года.\n\nКстати, если интересно подробнее узнать, как устроена подводная инфраструктура интернета, то рекомендуем почитать [https://vk.com/wall-183460226_695|этот пост].\n\n#google@tproger #интернет@tproger"
    },
    {
        "id": 1682940,
        "likes": 247,
        "reposts": 11,
        "text": "Чтобы аналитику данных как-то эти данные анализировать, ему нужно их откуда-то получать. Как правило, из баз данных. И чтобы аналитику не приходилось просить помощи у кого-то ещё, полезно знать и уметь применять SQL.\n\nО том, как это делать, рассказываем в статье:\n\nhttps://tproger.ru/blogs/why-data-analysts-need-sql/\n\n#sql@tproger #datascience@tproger"
    },
    {
        "id": 1682929,
        "likes": 22,
        "reposts": 1,
        "text": "Хотите изучать Python на pro-уровне?\n\nПройдите вступительный тест из 20 вопросов и поступите на продвинутый курс для разработчиков.\n\nЛишь 30% из всех желающих проходят вступительное тестирование. А вы сможете?\n\nПроверьте себя: https://otus.pw/dtFo/\n\nЭто #партнёрский пост"
    },
    {
        "id": 1682842,
        "likes": 151,
        "reposts": 1,
        "text": "Продолжаем показывать, в каких офисах работают сотрудники Microsoft. После [https://vk.com/wall-30666517_1679548|офиса в Редмонде] показываем, где работают мелкомягкие в Милане.\n\nНравится?\n\n#microsoft@tproger #офисы@tproger_web"
    },
    {
        "id": 1682824,
        "likes": 224,
        "reposts": 28,
        "text": "Огромнейшая подборка сайтов, которые связаны с дизайном:\n\nhttp://www.evernote.design/\n\nГайды, мокапы, ui kit'ы, стоковые видео, подкасты, форумы, инструменты, шрифты — проще назвать, чего там нет.\n\n#дизайн@tproger"
    },
    {
        "id": 1682784,
        "likes": 93,
        "reposts": 5,
        "text": "Телеканал Fox Sports элегантно решил проблему пустых трибун на соревнованиях из-за пандемии: на стадионах будут дорисовывать виртуальную толпу.\n\nВсё с максимальной реалистичностью: фанаты одетые в одежду в цветах играющих команд, «волна» из зрителей и правдоподобные реакции на происходящее на поле.\n\n#технологии@tproger"
    },
    {
        "id": 1682685,
        "likes": 690,
        "reposts": 61,
        "text": "15 алгоритмов сортировки за 6 минут. Осторожно, возможен гипноз:\n\n#сортировка@tproger #алгоритмы@tproger"
    },
    {
        "id": 1682584,
        "likes": 84,
        "reposts": 4,
        "text": "«Эй, жабист, какой у тебя камень в винте?» — спросил техдир у джуна. Понимаете, что здесь написано? Тогда вам не составит труда пройти наш тест по IT-сленгу:\n\nhttps://tproger.ru/quiz/it-slang/\n\nСможете набрать 14/14? \n\n#тесты@tproger"
    },
    {
        "id": 1682545,
        "likes": 141,
        "reposts": 4,
        "text": "Инженеры из Великобритании, Китая и Египта научили робота-руку делать человеку массаж.\n\nЕму показывают нужные движения, он их запоминает и может поддерживать комфортный и безопасный уровень нажатия на спину.\n\nКстати, это тот самый [https://vk.com/wall-30666517_1679980|робот], которого не так давно научили самостоятельно выполнять химические опыты.\n\n#роботы@tproger #медицина@tproger"
    },
    {
        "id": 1682478,
        "likes": 1069,
        "reposts": 150,
        "text": "Сайт, где в интерактивной форме можно попрактиковаться и изучить SQL:\n\nhttps://sqlbolt.com/lesson/introduction\n\n#sql@tproger"
    },
    {
        "id": 1682446,
        "likes": 593,
        "reposts": 73,
        "text": "Google выпустила новый бесплатный онлайн-курс по разработке на Kotlin для новичков: https://developer.android.com/courses/android-basics-kotlin/course\n\nПо словам Google, Kotlin уже используют 60% профессиональных Android-разработчиков, и на нём написано 70% из первой тысячи самых популярных приложений Play Store.\n\nПо такому поводу напомним о другом хорошем курсе по Kotlin от JetBrains, создателей языка: https://hyperskill.org/onboarding/?track=3\n\nИ ещё о трёх кодлабах от Google, где можно попрактиковаться:\n— Kotlin Bootcamp Course: https://codelabs.developers.google.com/kotlin-bootcamp/\n— Android Kotlin Fundamentals: https://codelabs.developers.google.com/android-kotlin-fundamentals/\n— Advanced Android in Kotlin: https://codelabs.developers.google.com/advanced-android-kotlin-training/\n\n#kotlin@tproger #google@tproger"
    },
    {
        "id": 1682405,
        "likes": 210,
        "reposts": 11,
        "text": "Односвязные списки — списки, узлы которых содержат данные и указатель на следующий узел.\n\nВ этой статье подробно разбираемся, как работает эта структура данных:\n\nhttps://tproger.ru/translations/introduction-to-linked-lists/\n\n#алгоритмы@tproger #javascript@tproger"
    },
    {
        "id": 1682303,
        "likes": 513,
        "reposts": 65,
        "text": "30 seconds of code — сайт с подборками коротких кусков кода, выполняющих конкретные задачи.\n\nНужно смержить несколько списков на Python? Отформатировать дату на C#? Или выполнить какие-то математические операции на Go?\n\nТут куча таких примеров: https://www.30secondsofcode.org/\n\n#python@tproger #csharp@tproger #go@tproger"
    },
    {
        "id": 1682265,
        "likes": 88,
        "reposts": 6,
        "text": "Выбираете между Kotlin и Java? Какой язык удобнее, какой перспективнее, да и вообще, на каком из них стоит писать Android-приложения? Мы опросили опытных разработчиков и сравнили два языка по шести критериям: \n \nhttps://tproger.ru/articles/java-vs-kotlin/ \n \n#android@tproger #java@tproger #kotlin@tproger"
    },
    {
        "id": 1682236,
        "likes": 59,
        "reposts": 7,
        "text": "Рекомендуем пару материалов, которые вышли у нас на сайте на прошедшей неделе:\n\n— 18+ вопросов заказчику, которые нужно задать перед началом работы: https://tprg.ru/ceaV\n\n— Полезные плагины для IDE: https://tprg.ru/Or8C\n\n#лучшеезанеделю@tproger"
    },
    {
        "id": 1682223,
        "likes": 23,
        "reposts": 3,
        "text": "Трансляция питчинга стартапов из бизнес-школы Сколково.\n\n8 команд представили свои технологические проекты, которые разрабатывали с нуля полгода.\n\nВ прикреплённом видео можно посмотреть обзор с комментариями ведущих, а вот ссылка на официальную трансляцию питчей: https://youtu.be/TdTTMp6LpDU"
    },
    {
        "id": 1681974,
        "likes": 95,
        "reposts": 2,
        "text": "Наверняка таких вопросов было много.\n\n#обсуждение@tproger"
    },
    {
        "id": 1681942,
        "likes": 21,
        "reposts": 3,
        "text": "Ближайшие события для айтишников: \n \n— Факультет Frontend-разработки \nСтарт по набору группы, онлайн, https://tprg.ru/5CvI \n \nПолучите современную профессию и год опыта, а ещё добавите несколько проектов в резюме. Достаточно знать основы программирования — остальному научат. \n \n— Онлайн-хакатон Fintech&Security Superhero, \nРегистрация до 27 июля, онлайн, https://clck.ru/PnmfF \n \nУчастников ждут задачи от Ак Барс Банка, Kaspersky Innovation Hub и InnoSTage, общий призовой фонд в 700 000 рублей, возможность получить предложение на работу и поддержка в запуске пилота. \n \n— Практический курс по Flutter в мобильной разработке \nСтарт 28 июля, онлайн, https://tprg.ru/eXmb \n \nНаучат с нуля создавать отзывчивые и быстрые мультиплатформенные приложения с помощью Flutter и Dart. Большое внимание уделят отзывчивому UI, User Experience и плавным анимациям в 60 FPS. \n \n— Конкурс GTP Indie Cup Summer‘20 \nРегистрация до 27 июля, онлайн, https://tprg.ru/UJ8z \n \nIndie Cup — это отличная возможность показать свою игру экспертам индустрии, прессе и издателям, получить комментарии и выиграть ценные призы. Среди них 18 билетов на 8 конференций, 3 лицензии на софт для разработчиков, а также 6 услуг и устройств. \n \n— Конференция «Fast Track: Безопасность веб-приложений» \n29 июля, онлайн, https://tprg.ru/EoT3 \n \nВ программе доклады длительностью 5–10 минут и решение практических задач на платформе Hacktory. Поговорят о важности безопасности веб-приложений, об угрозах и ошибках. \n \n— Big Data Webinar \n29 июля, онлайн, https://tprg.ru/5RCV \n \nСтарший разработчик EPAM выступит с докладом «Резиновая Big Datа» и расскажет: как быстро и эффективно обрабатывать большие объёмы данных, выводить в продакшен ETL-пайплайны в короткие сроки, а также о плюсах и минусах работы с платформой Databricks. \n \n#ивенты@tproger"
    },
    {
        "id": 1681898,
        "likes": 179,
        "reposts": 9,
        "text": "LG выпустила модуль Bluetooth low energy (BLE), который на 30% производительнее существующих продуктов и при этом на 75% меньше по размеру — всего 6х4 мм.\n\nВ дополнение ко всем этому, новый Bluetooth-чип отличается низким энергопотреблением, поэтому возможно мы последнее поколение, использующее фразу «блин, блютус всю батарею сожрал».\n\n#hardware@tproger #технологии@tproger"
    },
    {
        "id": 1681785,
        "likes": 433,
        "reposts": 34,
        "text": "IEEE опубликовал рейтинг языков программирования за 2020 год. Третий год подряд топ-3 не меняется: Python, Java и C.\n\nЯзыки оценивались по 11 параметрам, собранных по таким ресурсам как GitHub, StackOverflow, Google Search, Trends, Twitter и Reddit.\n\n#python@tproger #java@tproger #си@tproger"
    },
    {
        "id": 1681766,
        "likes": 1,
        "reposts": 0,
        "text": "#вакансии@tproger #работа@tproger \nНовосибирск (или любой город удалённо), опыт от 3 лет\n\nКомпания L2U, разрабатывающая платформу для контактных центров, ищет Java-разработчика уровня Middle и выше.\n\nПод капотом платформы топовые open source решения, такие как: Liferay, Camunda, Elasticsearch и т.д. Никакого legacy, никакой бюрократии — только эффективность и стремление к улучшению.\n\nИз преимуществ можно выделить:\n— возможность посещения профильных конференций и выступления на них;\n— возможность компенсации профильного обучения и сертификации;\n— премии по достижении бизнес-результата.\n\nУзнать подробности и откликнуться: https://tprg.ru/27PT"
    },
    {
        "id": 1681694,
        "likes": 373,
        "reposts": 16,
        "text": "Уверены, что используете свою IDE на полную?\n \nНаши эксперты поделились плагинами для разных IDE, которые они используют в своей работе. Проверьте, возможно какой-то плагин и вам облегчит жизнь:\n\nhttps://tproger.ru/experts/plugins-for-ide/\n\nА какие интересные плагины используете вы?\n\n#плагины@tproger #ide@tproger #эксперты@tproger"
    },
    {
        "id": 1681665,
        "likes": 3,
        "reposts": 2,
        "text": "В течение недели командам предстоит разработать прототипы новых продуктов: создать новые банковские сервисы и автоматизировать рутинные операции специалиста по кибербезопасности. \n \nУчастников ждёт общий призовой фонд в размере 700 000 рублей, возможность получить предложение на работу и запустить пилот при поддержке партнёров хакатона. \n \nРегистрация до 27 июля: https://clck.ru/PnmfF\n \nЭто #партнёрский пост"
    },
    {
        "id": 1681622,
        "likes": 280,
        "reposts": 15,
        "text": "Декораторы в Python — это функции, которые позволяют обернуть другую функцию для расширения её функциональности без изменения её кода.\n\nКак это работает? Подробно разбираемся с этим вопросом:\n\nhttps://tproger.ru/translations/demystifying-decorators-in-python/\n\n#python@tproger"
    },
    {
        "id": 1681570,
        "likes": 236,
        "reposts": 10,
        "text": "Инженер-ютубер создал робота-парикмахера и стал его первым живым клиентом.\n\nС помощью камер робот создаёт трёхмерную модель головы клиента, на основе которой и определяет, где и сколько состричь. Механизм позиционирования позволяет двигаться вокруг клиента, подносить ножницы к голове с разных сторон, как это делает настоящий парикмахер.\n\nКроме стрижки робот готов поддержать светскую беседу с клиентом, например спрашивая у того, как прошли его выходные. Стрижёт робот, к сожалению, пока лишь то, что на виду, и понятия не имеет, как подобраться к волосам за ушами.\n\n#роботы@tproger #diy@tproger"
    },
    {
        "id": 1681489,
        "likes": 261,
        "reposts": 13,
        "text": "Энтузиаст для прохождения Minecraft запрограммировал... картошку.\n\nДля этого он использовал несколько картошечек, провода, микроконтроллер и модуль акселерометра для мыши. Каждый из корнеплодов был запрограммирован на выполнение какого-либо определённого действия: вперёд, прыжок, инвентарь, левая кнопка мыши, правая кнопка мыши, скролл и сама мышь.\n\nО подробностях разработки автор рассказывает в этом видео: https://tprg.ru/kQBh\n\nP. S. Нет, автор сего чуда не из Беларуси.\n\n#diy@tproger #minecraft@tproger #кек@tproger"
    },
    {
        "id": 1681481,
        "likes": 7,
        "reposts": 0,
        "text": "За 12 месяцев можно получить современную востребованную профессию и набраться опыта для последующего трудоустройства. \n \nОбучение разбито на 4 семестра: \n— Веб-верстка. \n— Фронтенд-разработка. \n— Библиотека ReactJS и основы backend-разработки. \n— Разработка от идеи до релиза. \n \nПо окончанию получите диплом государственного образца и сертификат. \n \nЧитайте подробнее и начинайте изучать фронтенд-разработку уже сейчас: https://tprg.ru/5CvI\n \nЭто #партнёрский пост"
    },
    {
        "id": 1681441,
        "likes": 350,
        "reposts": 18,
        "text": "Следом за вчерашней новостью о [https://vk.com/wall-30666517_1681139|«внешнем чипировании»] от Google появилась свежая информация о разработках стартапа Илона Маска Neuralink.\n\nНа этот раз он заявил, что с помощью встроенных в мозг чипов люди смогут слушать музыку без наушников, повышать свои мыслительные способности и снижать тревожность. Эксперименты над животными уже проведены в этом году, как только будет получено разрешение от Министерства здравоохранения США, то протестируют и на людях.\n\nБудущее наступило?\n\n#илонмаск@tproger #технологии@tproger"
    },
    {
        "id": 1681411,
        "likes": 64,
        "reposts": 4,
        "text": "[club183460226|Веб-страница] — паблик, в котором регулярно появляются крутые материалы по веб-разработке. Например, сейчас в закрепе вы найдёте сайт с перечнем полезных инструментов и материалов для их изучения. \n \nПодписывайтесь и забирайте в закладки самое «вкусное»: [club183460226|@tproger_web]"
    },
    {
        "id": 1681388,
        "likes": 95,
        "reposts": 11,
        "text": "Как оценить, насколько хорош UX вашего продукта?\n\nЕсть вполне очевидные методы типа [https://vk.com/wall-30666517_1667578|A/B-тестирования] и опроса пользователей. Но это только верхушка айсберга, на самом деле методов оценки UX гораздо больше.\n\nНа картинке — 21 метод, подходящие на определённых стадиях разработки, а в этой статье о каждом их этих методов можно почитать подробнее: https://tprg.ru/0aVb\n\n#ux@tproger"
    },
    {
        "id": 1681380,
        "likes": 24,
        "reposts": 0,
        "text": "#вакансии@tproger #работа@tproger \nУдалённо, опыт от 2 лет\n\nКомпания-разработчик решений для видеоигр Xsolla собирает команды на два проекта.\n\nПервый — сервис для работы с DLC и облачными сохранениями. Туда требуются:\n— Frontend Developer (React.js/ Electron.js): https://tprg.ru/1WVP\n— C++ Developer: https://tprg.ru/527H\n— Golang Developer: https://tprg.ru/0If6\n\nВторой — интерактивный сервис игровой аналитики. В эту команду нужны:\n— Frontend Developer (React): https://tprg.ru/dmoy\n— Backend Developer (PHP/Go): https://tprg.ru/1A4E\n\nИз преимуществ можно выделить бонус по завершению проекта и возможность совмещать его с основной работой."
    },
    {
        "id": 1681318,
        "likes": 65,
        "reposts": 5,
        "text": "Планируете собственный проект? Но ведь это не только разработка, вы в курсе? Потренируйтесь с Тирексом, который запускает стартап по игре на укулеле: пройдя тест-квест от Tproger и Selectel, вы узнаете о подводных камнях запуска продукта и запасётесь нужными знаниями.\n\nhttps://tproger.ru/quiz/startup-from-selectel/\n\nЭто #партнёрский пост"
    },
    {
        "id": 1681276,
        "likes": 128,
        "reposts": 13,
        "text": "Шпаргалка по истории развития операционных систем семейства Unix.\n\nПо ссылке — оригинал в формате .SVG: https://tprg.ru/XnKA\n\n#unix@tproger #ос@tproger"
    },
    {
        "id": 1681196,
        "likes": 770,
        "reposts": 35,
        "text": "GitHub спрятал 21 ТБ данных в арктической мерзлоте на случай конца света. Таким образом они выполнили своё обещание хранить всё программное обеспечение с открытым исходным кодом в арктическом хранилище (сделать они это хотели раньше, но помешала пандемия).\n\nДанные записали на 186 катушек piqlFilm — цифровую светочувствительную архивную пленку, которую может считать компьютер или человек с лупой. Коллекцию поместили внутрь камеры бывшей угольной шахты, которая находятся в глубине ста метров в вечной мерзлоте.\n\nВсе сохранённые данные позволят будущим поколениям понять, каким был современный мир, и даже воссоздать компьютеры и технологии. Надеемся, в действительности это никому и никогда не пригодится.\n\n#github@tproger"
    },
    {
        "id": 1681139,
        "likes": 628,
        "reposts": 50,
        "text": "В Google придумали «умные татуировки», с помощью которых можно управлять различными электронными устройствами.\n\nВ Google говорят, что жесты пальцами и кистями рук проще, естественнее и привычнее всех остальных способов отдачи команд. К тому же, татуировка всегда с собой и не нуждается в подзарядке.\n\nКак тебе такое, Билл Гейтс?\n\n#технологии@tproger"
    },
    {
        "id": 1681115,
        "likes": 13,
        "reposts": 0,
        "text": "#вакансии@tproger #работа@tproger \nЕкатеринбург и Березовский, 80 000–130 000 ₽\n\nРегиональная оптовая компания по продаже автокомпонентов «Авто-Траст» ищет программиста 1С.\n\nЕсть задачи по следующим направлениям: опт, розница, логистика и внутренний учет. Нужно будет, например:\n— внедрять и развивать различные торговые и логистические системы,\n— настраивать интеграции с внешними и внутренними сервисами.\n\nИз преимуществ можно выделить релокационный пакет, мощное железо и компенсацию обедов. Кроме того, можно выбрать время начала рабочего дня (с 8 до 12) и один из двух удобных офисов, в которые организован трансфер.\n\nУзнать подробности и откликнуться: https://tprg.ru/8nbp"
    },
    {
        "id": 1680870,
        "likes": 521,
        "reposts": 17,
        "text": "Оказывается, простые математические операции происходят в уме у каждого по-разному. В твиттере завязалось обсуждение, в котором люди рассказывают, как складываются 27 и 48 в их голове.\n\nА как сложили бы эти числа вы?"
    }
]