<template>
    <v-layout class="pane scroller" :class="`theme--${$vuetify.theme.dark ? 'dark' : 'light'}`">
        <v-container class="pane__topic" :class="{ fullscreen, mobile }">
            <h1 class="pane__topic-title mb-5">Пользовательское соглашение</h1>

            <p class="pane__topic-definition">
                Настоящее Пользовательское Соглашение (далее Соглашение) регулирует отношения между владельцем netaggregator.ru
                (далее Netaggregator или Администрация) с одной стороны и пользователем сайта с другой. Сайт Netaggregator
                (в дальнейшем Сайт) не является средством массовой информации. Используя сайт, Вы соглашаетесь с условиями
                данного соглашения. Размещаемая на страницах сайта информация предназначена для свободного ознакомления.
            </p>

            <p>
                1. Вся информация предоставляется в исходном виде, без гарантий полноты или своевременности, и без иных
                явно выраженных или подразумеваемых гарантий. Доступ к сайту, а также использование его содержимого
                осуществляются исключительно по вашему усмотрению и на ваш риск.
            </p>
            <p>
                2. Администрация (владельцы сайта, учредители, агенты, администраторы, модераторы и иные представители)
                прикладывает все усилия, чтобы обеспечить пользователей точной и достоверной информацией, но в то же время не
                исключает возможности возникновения ошибок.
            </p>
            <p>
                3. Содержимое сайта Netaggregator находится в свободном доступе в сети интернет по адресу netaggregator.ru
                и предоставляется свободно, по принципу «как есть», без заключения каких-либо договоров между Пользователями,
                Администрацией, владельцами серверов, на которых он размещён, либо иных (не оговоренных выше) лиц, связанных
                с сайтом и его сервисами, которые могут стать предметом прямых и/или косвенных претензий.
            </p>
            <p>
                4. Администрация не дает каких-либо заверений или гарантий в отношении сайта и его содержимого, в том числе,
                без ограничения, в отношении своевременности, актуальности, точности, полноты, достоверности, доступности или
                соответствия для какой-либо конкретной цели сайта и содержимого, в отношении того, что при использовании сайта
                не возникнет ошибок, оно будет безопасным и бесперебойным, что Администрация будет исправлять какие-либо ошибки,
                или что на сайте не будет вирусов или иных вредоносных кодов, а так же, что содержимое и сайт не нарушают прав
                третьих лиц.
            </p>
            <p>
                5. Некоторые ссылки на этом сайте ведут к ресурсам, расположенным на сторонних сайтах. Данные ссылки размещены
                для удобства пользователей и не означают, что Администрация одобряет содержание других сайтов. Кроме этого,
                Администрация сайта не несет никакой ответственности за доступность этих ресурсов и за их контент. Это заявление
                относится ко всем ссылкам, представленным на сайте, и материалам всех веб-сайтов, доступных через баннеры
                и ссылки на веб-сайте по адресу netaggregator.ru.
            </p>
            <p>
                6. В обязанности Администрации не входит контроль легальности или нелегальности передаваемой информации
                (любой, включая, но не ограничиваясь, информацией передаваемой между пользователями, внутренней пересылки
                информации в виде различных ссылок, текстов или архивов), определение прав собственности или законности передачи,
                приема или использования этой информации.
            </p>
            <p>
                7. Администрация принимает разумные меры для обеспечения точности, актуальности и правомерности содержимого,
                но она не принимает на себя ответственности за действия лиц или организаций, прямо или иным образом осуществленные
                на основании информации, имеющейся на сайте или полученной через него, как предоставленной Администрацией,
                так и третьими лицами.
            </p>
            <p>
                8. В соответствии с действующим законодательством, Администрация отказывается от каких-либо заверений и гарантий,
                предоставление которых может иным образом подразумеваться, и отказывается от ответственности в отношении сайта,
                содержимого и их использования. Ни при каких обстоятельствах Администрация сайта не будет нести ответственности
                за какой-либо прямой, непрямой, особый или иной косвенный ущерб в результате любого использования, а равно как
                и невозможностью использования сайта, содержимого или каких-либо связанных сервисов, даже если администрация
                будет явно поставлена в известность о возможности такого ущерба.
            </p>
            <p>
                9. Сайт может использовать файлы cookies для хранения информации о пользователе, так и общей информации.
                «Cookies» представляют собой небольшие текстовые файлы, которые могут использоваться сайтом для идентификации
                посетителей, упрощения доступа и использования посетителем сайта, а также отслеживания сайтом обращений посетителей
                и сбора общей информации для улучшения содержания. Пользуясь сайтом, вы выражаете свое согласие на
                использование сайтом cookies.
            </p>
            <p>
                10. Администрация оставляет за собой право вносить изменения без уведомления о них пользователей.
                Также Администрация не несет ответственности за изменение, редактирование или удаление любой информации,
                добавленной вами на сайт или другие связанные с ним проекты.
            </p>
            <p>
                11. Администрация вправе отказать в доступе к сайту любому пользователю, или группе пользователей без объяснения
                причин своих действий и предварительного уведомления.
            </p>
            <p>
                12. Администрация вправе изменять либо удалять ссылки на информацию, графические, звуковые и прочие данные,
                размещенные пользователями на сайте, без предварительного уведомления и объяснения причин своих действий.
            </p>
            <p>
                13. Любые торговые марки, знаки и названия товаров, служб и организаций, права на дизайн, авторские и смежные права,
                которые упоминаются, используются или цитируются на страницах сайта, принадлежат их законным владельцам и их
                использование здесь не дает пользователю право на любое другое использование, если не указано иное. Страницы данного
                сайта никак не связаны с правообладателями, и никто кроме правообладателя не может распоряжаться правами на использование
                материалов, защищенных авторским правом. Пользователь несет ответственность за использование этих и подобных материалов.
            </p>
            <p>
                14. Чтение и распространение информации, размещённой на данном сайте, может являться нарушением
                законов той страны, в которой вы просматриваете этот сайт.
            </p>
            <p>
                15. Пользователь соглашается с тем, что все возможные споры будут разрешаться по нормам российского права.
            </p>
            <p>
                16. Бездействие со стороны Администрации в случае нарушения пользователем либо группой пользователей
                пользовательского соглашения не лишает Администрации права предпринять соответствующие действия в
                защиту интересов сайта позднее.
            </p>
            <p>
                17. Все права на материалы, находящиеся на сайте, охраняются в соответствии с законодательством РФ,
                в том числе, об авторском праве и смежных правах.
            </p>
            <p>
                18. Логотип, компоновка и дизайн страниц на данном сайте защищены авторским правом.
            </p>
            <p>
                19. Если в соответствии с действующими законами какие-либо условия будут признаны недействительными,
                остальные условия остаются в полной силе.
            </p>
            <p>
                20. Используя данный сайт, Вы выражаете свое согласие с "Отказом от ответственности", установленными Правилами
                и принимаете всю ответственность, которая может быть возложена на Вас.
            </p>
            <p>
                21. Администрация сайта в любое время вправе внести изменения в Правила, которые вступают в силу с момента публикации.
                Продолжение пользования Сайтом после внесения изменений означает Ваше автоматическое согласие на соблюдение
                новых правил.
            </p>

            <p>Обновлено: 07 Октября 2021 года</p>
        </v-container>
    </v-layout>
</template>

<script>
    import { help } from '~/mixins/common'

    /**
    * @see http://ecommercelaw.ru/docs/polzovsogl.html
    * @see https://praville.ru/generator/a_gen.php
    */
    export default {
        mixins: [help],

        props: {
            fullscreen: {
                type: Boolean,
                required: true
            }
        },
        computed: {
            mobile() {
                return !!(this.$BROWSER || {}).IS_MOBILE
            }
        },
        watch: {
            fullscreen() {
                this.smooth.scrollTo(null, 0)
            }
        }
    }
</script>

<style lang="scss" scoped>
    .pane.scroller {
        .container {
            h1 {
                color: #006dad;
                font-size: 2vmax;
                text-align: center;
                line-height: 1.2;
                margin: 0;
            }
            h2 {
                font-size: 1.8em;
                text-align: center;
            }
            h3 {
                font-size: 1.6em;
                text-align: center;
            }
            p {
                padding: 0 0 .5em;
                line-height: 150%;
            }
            a {
                text-decoration: none;
                cursor: pointer;
                color: #6c94c4;
            }
        }
        &.theme--dark {
            .container h1 {
                color: hsla(0,0%,100%,.7);
            }
        }
    }
</style>
