<template>
    <v-layout class="pane scroller" :class="`theme--${$vuetify.theme.dark ? 'dark' : 'light'}`">
        <v-container class="pane__topic" :class="{ fullscreen, mobile }">
            <h1 class="pane__topic-title mb-5">Стоимость услуг и порядок оплаты</h1>

            <p>
                1. Стоимость Услуг определяется на момент их оплаты Заказчиком согласно выбранному Тарифу.
            </p>
            <p>
                2. Услуги предоставляются на условиях предоплаты, которая осуществляется в соответствии с тарифной линейкой, опубликованной в приложении.
            </p>
            <p>
                3. Датой оплаты Услуг считается дата зачисления денежных средств на текущий счёт Исполнителя.
            </p>
            <p>
                4. Услуги предоставляются путем открытия доступа к сервису для учетной записи пользователя, указанной Заказчиком.
            </p>
            <p>
                5. В случае, если по окончании срока использования услуги, предусмотренного тарифом Заказчиком не оплачивается использование услуги на новый срок, Исполнитель без предварительного уведомления и непосредственно при окончании оплаченного срока использования услуг прекращает доступ пользователя к услугам.
            </p>
            <p>
                6. В случае неиспользования Заказчиком услуг (отсутствие у Заказчика необходимости в услугах, невозможности получения услуг, которая обусловлена техническими или иными проблемами со стороны Заказчика или Пользователя, блокировка Учетной записи в социальной сети) стоимость оплаченных Заказчиком услуг не возвращается, при этом услуга считается оказанной в полном объеме.
            </p>
            <p>
                7. При перечислении денежных средств для оплаты услуг через сторонние платежные системы, Заказчик обязуется следовать всем инструкциям, опубликованным на сайте платежной системы, с помощью которой осуществляется перевод денежных средств. Правильность выполнения Заказчиком условий оплаты через стороннюю платежную систему находится вне контроля Исполнителя и Исполнитель не несет за это ответственности.
            </p>
            <p>
                8. Все расходы, связанные с перечислением денежных средств с помощью платежных систем и сервисов (включая, но не ограничиваясь, сборы и комиссии данных систем, налоги и т.д.), оплачиваются Заказчиком самостоятельно и за свой счет.
            </p>
            <p>
                9. Оказываемые Исполнителем услуги не облагаются НДС.
            </p>

            <p>Обновлено: 07 Октября 2021 года</p>
        </v-container>
    </v-layout>
</template>

<script>
    import { help } from '~/mixins/common'

    /**
    * @see https://tilda.cc/ru/privacy-generator
    * @see https://tools.joomlatown.net
    */
    export default {
        mixins: [help],

        props: {
            fullscreen: {
                type: Boolean,
                required: true
            }
        },
        computed: {
            mobile() {
                return !!(this.$BROWSER || {}).IS_MOBILE
            }
        },
        watch: {
            fullscreen() {
                this.smooth.scrollTo(null, 0)
            }
        }
    }
</script>

<style lang="scss" scoped>
    .pane.scroller {
        .container {
            h1 {
                color: #006dad;
                font-size: 2vmax;
                text-align: center;
                line-height: 1.2;
                margin: 0;
            }
            h2 {
                font-size: 1.8em;
                text-align: center;
            }
            h3 {
                font-size: 1.6em;
                text-align: center;
            }
            p {
                padding: 0 0 .5em;
                line-height: 150%;
            }
            a {
                text-decoration: none;
                cursor: pointer;
                color: #6c94c4;
            }
        }
        &.theme--dark {
            .container h1 {
                color: hsla(0,0%,100%,.7);
            }
        }
    }
</style>
