<template>
    <v-layout class="pane scroller" :class="`theme--${$vuetify.theme.dark ? 'dark' : 'light'}`">
        <v-container class="pane__topic" :class="{ fullscreen, mobile }">
            <h1 class="pane__topic-title mb-5">Политика конфиденциальности персональных данных</h1>

            <p class="pane__topic-definition">
                Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) составлена
                в соответствии с требованиями Федерального закона от 27.07.2006. №152-ФЗ «О персональных данных»
                (далее - Закон о персональных данных) и действует в отношении всей информации, которую сайт <strong>Netaggregator</strong>,
                (далее – Netaggregator) расположенный на доменном имени <strong>netaggregator.ru</strong> (а также его субдоменах),
                может получить о Пользователе во время использования сайта.
            </p>

            <h2>1. Определение терминов</h2>
            <p><strong>1.1 В настоящей Политике конфиденциальности используются следующие термины:</strong></p>

            <p>
                1.1.1. «<strong>Администрация сайта</strong>» (далее Администрация) - владелец сайта, а также уполномоченные сотрудники,
                которые организуют и осуществляют управление сайтом <strong>Netaggregator</strong>, определяющие его функциональность,
                информационное содержание и являющиеся Операторами персональных данных.
            </p>
            <p>
                1.1.2. «<strong>Оператор  персональных данных</strong>» (далее Оператор) - юридическое или физическое лицо, самостоятельно
                или совместно с другими лицами организующие и (или) осуществляющие обработку персональных данных, а также определяющие цели
                обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции),
                совершаемые с персональными данными.
            </p>
            <p>
                1.1.3. «<strong>Персональные данные</strong>» - любая информация, относящаяся к прямо или косвенно определенному, или определяемому
                физическому лицу (субъекту персональных данных).
            </p>
            <p>
                1.1.4. «<strong>Обработка персональных данных</strong>» - любое действие (операция) или совокупность действий (операций), совершаемых
                с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись,
                систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу
                (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.
            </p>
            <p>
                1.1.5. «<strong>Конфиденциальность персональных данных</strong>» - обязательное для соблюдения Оператором или иным получившим доступ
                к персональным данным лицом требование, не допускать их распространения без согласия субъекта персональных данных или
                наличия иного законного основания.
            </p>
            <p>
                1.1.6. «<strong>Субъект персональных данных</strong>», «<strong>Пользователь сайта</strong>» (далее Пользователь) - лицо,
                имеющее доступ к сайту <strong>Netaggregator</strong>, посредством сети Интернет и использующее информацию, материалы
                и продукты сайта <strong>Netaggregator</strong>.
            </p>
            <p>
                1.1.7. «<strong>Сайт</strong>» - это совокупность связанных между собой веб-страниц, размещенных в сети Интернет
                по уникальному адресу (URL): <strong>netaggregator.ru</strong>, а также его субдоменах.
            </p>
            <p>
                1.1.8. «<strong>Субдомены</strong>» - это страницы или совокупность страниц, расположенные на доменах третьего уровня,
                принадлежащие сайту Netaggregator, а также другие временные страницы, внизу который указана контактная
                информация Администрации
            </p>
            <p>
                1.1.9. «<strong>API</strong>» - определённый набор HTTP-запросов и соответствующие им HTTP-ответы, для обмена данными
                между различными сервисами и службами, как в рамках одного домена, так и по сети Интернет в целом.
                <a href="//ru.wikipedia.org/wiki/API#Web_API" target="_blank" rel="noreferrer">[wikipedia]</a>
            </p>
            <p>
                1.1.10. «<strong>Cookies</strong>» - небольшой фрагмент данных, отправленный веб-сервером и хранимый на компьютере пользователя,
                который веб-клиент или веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть страницу
                соответствующего сайта.
            </p>
            <p>
                1.1.11. «<strong>IP-адрес</strong>» - уникальный сетевой адрес узла в компьютерной сети,
                через который Пользователь получает доступ к сайту.
            </p>

            <h2>2. Общие положения</h2>
            <p>
                2.1. Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека
                и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную
                и семейную тайну.
            </p>
            <p>
                2.2. Использование сайта Netaggregator Пользователем означает безоговорочное согласие cубъекта персональных данных
                с настоящей Политикой и указанными в ней условиями обработки его персональной информации.
            </p>
            <p>
                2.3. В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование
                сайта Netaggregator.
            </p>
            <p>
                2.4. Настоящая Политика конфиденциальности применяется к сайту Netaggregator. Администрация не контролирует
                и не несет ответственность за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным
                на сайте.
            </p>
            <p>
                2.5. Политика может быть изменена без какого-либо специального уведомления. Новая редакция Политики вступает в
                силу с&nbsp;момента ее публикации на сайте, если иное не предусмотрено новой редакцией Политики.
            </p>
            <p>
                2.6. Администрация не проверяет достоверность персональных данных, предоставляемых Пользователем.
            </p>

            <h2>3. Предмет политики конфиденциальности</h2>
            <p>
                3.1. Настоящая Политика конфиденциальности устанавливает обязательства Администрации по неразглашению и обеспечению
                режима защиты конфиденциальности персональных данных, которые Пользователь предоставляет при авторизации
                на сайте Netaggregator, путем запроса к публичному API социальной сети ВКонтакте при подписке на информационную
                e-mail рассылку или при оформлении заказа.
            </p>
            <p>
                3.2. Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности, включают в себя следующую информацию:<br>
                3.2.1. данные, передающиеся автоматически при посещении страниц сайта с&nbsp;помощью, установленного на&nbsp;устройстве
                субъекта персональных данных, программного обеспечения, а также данные, необходимые для отображения
                и&nbsp;обеспечения работы cайта, в том числе (IP адрес, информация о браузере, время доступа, реферер)<br>
                3.2.2. обезличенные данные о посетителях (в т.ч. файлов «cookie») с помощью сервисов интернет-статистики
                (Яндекс Метрика, Гугл Аналитика и ВК Пиксел)<br>
                3.2.3. фамилия, имя, отчество Пользователя (публичное API ВКонтакте)<br>
                3.2.4. фотография Пользователя (публичное API ВКонтакте)<br>
            </p>

            <p>
                3.3. Любая иная персональная информация неоговоренная выше, подлежит надежному хранению и нераспространению,
                за исключением случаев, предусмотренных в п.п. 5.2. и 5.3. настоящей Политики конфиденциальности.
            </p>
            <p>
                3.4. Обработка специальных категорий персональных данных, касающихся расовой, национальной принадлежности,
                политических взглядов, религиозных или философских убеждений, генетические или биометрические данные,
                данные о здоровье и интимной жизни, Оператором не осуществляется.
            </p>

            <h2>4. Цели сбора персональной информации пользователя</h2>
            <p>
                4.1. Идентификации Пользователя для его дальнейшей авторизации на сайте Netaggregator.
            </p>
            <p>
                4.2. Предоставления Пользователю доступа к персонализированным данным сайта Netaggregator.
            </p>
            <p>
                4.3. Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования
                сайта Netaggregator, оказания услуг и обработки запросов и заявок от Пользователя.
            </p>
            <p>
                4.4. Предоставления Пользователю эффективной технической поддержки при возникновении проблем, связанных с использованием
                сайта Netaggregator.
            </p>
            <p>
                4.5. Предоставления Пользователю с его согласия специальных предложений, информации о ценах, новостной рассылки и
                иных сведений.
            </p>
            <p>
                4.1.6. Осуществления рекламной деятельности с согласия Пользователя.
            </p>

            <h2>5. Способы и сроки обработки персональной информации</h2>
            <p>
                5.1. Сбор и обработка персональных данных Пользователя осуществляется как во время просмотра сайта, так и в течение
                всего срока оказания услуг и использования сервисов сайта, любым законным способом, в том числе с использованием
                средств автоматизации.
            </p>
            <p>
                5.2. Пользователь соглашается с тем, что Администрация вправе передавать персональные данные третьим лицам,
                исключительно рамках реализации услуг, предоставляемых сайтом и осуществления финансовых операций.
            </p>
            <p>
                5.3. Персональные данные Пользователя могут быть переданы уполномоченным органам государственной власти Российской
                Федерации только по основаниям и в порядке, установленным законодательством Российской Федерации.
            </p>
            <p>
                5.4. При утрате или разглашении персональных данных Администрация вправе не информировать Пользователя об утрате или
                разглашении персональных данных.
            </p>
            <p>
                5.5. Администрация принимает необходимые организационные и технические меры для защиты персональной информации
                Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения,
                а также от иных неправомерных действий третьих лиц.
            </p>
            <p>
                5.6. Вся информация, которая собирается сторонними сервисами, в том числе платежными системами, средствами связи и другими
                поставщиками услуг, хранится и обрабатывается указанными лицами (Операторами) в соответствии с их Пользовательским соглашением
                и Политикой конфиденциальности. Субъект персональных данных и/или Пользователь обязан самостоятельно своевременно ознакомиться
                с указанными документами. Оператор не несет ответственность за действия третьих лиц, в том числе указанных в настоящем пункте
                поставщиков услуг.
            </p>

            <h2>6. Права и обязанности сторон</h2>
            <p><strong>6.1. Пользователь вправе:</strong></p>
            <p>
                6.1.1. Принимать свободное решение о предоставлении своих персональных данных, необходимых для использования
                сайта Netaggregator, и давать согласие на их обработку.
            </p>
            <p>
                6.1.2. Обновлять, дополнять предоставленную информацию о персональных данных в случае изменения данной информации.
            </p>
            <p>
                6.1.3. Получать информацию, касающуюся обработки его персональных данных, если такое право не ограничено
                федеральными законами.
            </p>
            <p>
                6.1.4. Требовать уточнения его персональных данных, их блокирования или уничтожения в случае, если
                персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми
                для заявленной цели обработки, а также принимать предусмотренные законом меры по защите своих прав.
            </p>

            <p><strong>6.2. Администрация обязана:</strong></p>
            <p>
                6.2.1. Использовать полученную информацию исключительно для целей, указанных в п. 4 настоящей Политики конфиденциальности.
            </p>
            <p>
                6.2.2. Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного
                разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование, либо разглашение иными возможными
                способами переданных персональных данных Пользователя, за исключением п.п. 5.2 и 5.3. настоящей
                Политики конфиденциальности.
            </p>
            <p>
                6.2.3. Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку,
                используемого для защиты информации в существующем электронном документообороте, установленным законодательством
                Российской Федерации.
            </p>
            <p>
                6.2.4. Осуществлять блокирование персональных данных, относящихся к соответствующему Пользователю, с момента
                обращения или запроса Пользователя, или его законного представителя либо уполномоченного органа по защите прав
                субъектов персональных данных на период проверки, в случае выявления недостоверных персональных данных или
                неправомерных действий.
            </p>

            <h2>7. Ответственность сторон</h2>
            <p>
                7.1. В случае утраты или разглашения Конфиденциальной информации Администрация не несёт ответственность,
                если данная конфиденциальная информация:<br>
                7.1.1. Стала публичным достоянием до её утраты или разглашения.<br>
                7.1.2. Была получена от третьей стороны до момента её получения Администрацией ресурса.<br>
                7.1.3. Была разглашена с согласия Пользователя.
            </p>
            <p>
                7.2. Пользователь несет полную ответственность за соблюдение требований законодательства РФ, в том числе законов о
                рекламе, о защите авторских и смежных прав, об охране товарных знаков и знаков обслуживания, но не ограничиваясь
                перечисленным, включая полную ответственность за содержание и форму материалов.
            </p>
            <p>
                7.3. Пользователь признает, что ответственность за любую информацию (в том числе, но не ограничиваясь: файлы с данными,
                тексты и т.д.), к которой он может иметь доступ как к части сайта Netaggregator, несет лицо, предоставившее
                такую информацию.
            </p>
            <p>
                7.4. Пользователь соглашается, что информация, предоставленная ему как часть сайта Netaggregator, может
                являться объектом интеллектуальной собственности, права на который защищены и принадлежат другим Пользователям,
                партнерам или рекламодателям, которые размещают такую информацию на сайте Netaggregator. Пользователь не вправе
                вносить изменения, передавать в аренду, передавать на условиях займа, продавать, распространять или создавать
                производные работы на основе такого Содержания (полностью или в части), за исключением случаев, когда такие действия
                были письменно прямо разрешены собственниками такого Содержания в соответствии с условиями отдельного соглашения.
            </p>
            <p>
                7.5. В отношение текстовых материалов (статей, публикаций, находящихся в свободном публичном доступе на
                сайте Netaggregator) допускается их распространение при условии, что будет дана ссылка на Netaggregator.
            </p>
            <p>
                7.6. Администрация не несет ответственности перед Пользователем за любой убыток или ущерб, понесенный Пользователем
                в результате удаления, сбоя или невозможности сохранения какого-либо Содержания и иных коммуникационных данных,
                содержащихся на сайте Netaggregator или передаваемых через него.
            </p>
            <p>
                7.7. Администрация не несет ответственности за любые прямые или косвенные убытки, произошедшие из-за: использования
                либо невозможности использования сайта, либо отдельных сервисов; несанкционированного доступа к коммуникациям
                Пользователя; заявления или поведение любого третьего лица на сайте.
            </p>
            <p>
                7.8. Администрация не несет ответственность за какую-либо информацию, размещенную пользователем на
                сайте Netaggregator, включая, но не ограничиваясь: информацию, защищенную авторским правом, без прямого
                согласия владельца авторского права.
            </p>

            <h2>8. Разрешение споров</h2>
            <p>
                8.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем и Администрацией,
                обязательным является предъявление претензии (письменного предложения или предложения в электронном виде
                о добровольном урегулировании спора).
            </p>
            <p>
                8.2. Получатель претензии в течение 30 календарных дней со дня получения претензии, письменно или в электронном
                виде уведомляет заявителя претензии о результатах рассмотрения претензии.
            </p>
            <p>
                8.3. При не достижении соглашения, спор будет передан на рассмотрение Арбитражного суда.
            </p>
            <p>
                8.4. К настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией
                применяется действующее законодательство Российской Федерации.
            </p>

            <h2>9. Заключительные положения</h2>
            <p>
                9.1. Пользователь может получить любые разъяснения по интересующим вопросам, касающимся обработки его персональных данных,
                обратившись к Оператору с помощью электронной почты support@netaggregator.ru.
            </p>
            <p>
                9.2. Все предложения или вопросы касательно настоящей Политики конфиденциальности следует сообщать по
                адресу: support@netaggregator.ru
            </p>
            <p>
                9.3. В данном документе будут отражены любые изменения политики обработки персональных данных Оператором. Политика действует
                бессрочно до замены ее новой версией.
            </p>

            <p>Обновлено: 07 Октября 2021 года</p>
        </v-container>
    </v-layout>
</template>

<script>
    import { help } from '~/mixins/common'

    /**
    * @see https://tilda.cc/ru/privacy-generator
    * @see https://tools.joomlatown.net
    */
    export default {
        mixins: [help],

        props: {
            fullscreen: {
                type: Boolean,
                required: true
            }
        },
        computed: {
            mobile() {
                return !!(this.$BROWSER || {}).IS_MOBILE
            }
        },
        watch: {
            fullscreen() {
                this.smooth.scrollTo(null, 0)
            }
        }
    }
</script>

<style lang="scss" scoped>
    .pane.scroller {
        .container {
            h1 {
                color: #006dad;
                font-size: 2vmax;
                text-align: center;
                line-height: 1.2;
                margin: 0;
            }
            h2 {
                font-size: 1.8em;
                text-align: center;
            }
            h3 {
                font-size: 1.6em;
                text-align: center;
            }
            p {
                padding: 0 0 .5em;
                line-height: 150%;
            }
            a {
                text-decoration: none;
                cursor: pointer;
                color: #6c94c4;
            }
        }
        &.theme--dark {
            .container h1 {
                color: hsla(0,0%,100%,.7);
            }
        }
    }
</style>
