export default [
    'Окружай себя только теми людьми, которые будут тянуть тебя выше. Жизнь уже и так полна теми, кто хочет тянуть тебя вниз.',
    'Неважно, в каком ты живёшь мире, важно, какой мир живёт в тебе… Ибо внутренний мир станет рождением мира внешнего…',
    'Нужно уметь уходить вовремя. Чтобы после твоего ухода вздохнули не с облегчением, а с сожалением.',
    'А помнишь?.. Этот вопрос с годами мелькает все чаще, становясь все трогательнее и все грустнее.',
    'Не подражайте другим. Найдите себя и оставайтесь собой, зависть — это невежество, а подражание — самоубийство.',
    'Во всем виноват Эйнштейн. В 1905 году он заявил, что абсолютного покоя нет, и с тех пор его действительно нет.',
    'Человек меньше всего похож на себя, когда говорит от своего имени. Дайте ему маску, и он расскажет всю правду.',
    'Никогда не надейся, что изменится кто-то другой. Изменения всегда нужно начинать с самого себя.',
    'Настоящий гений — человек, живущий в том мире, который он сам придумал и построил',
    'Самые нелепые и безрассудные устремления иногда приводят к чрезвычайному успеху.',
    'Единственная разница между хорошим и плохим днём — твоё отношение к нему.',
    'Надо всегда быть радостным. Если радость кончается, ищи, в чем ошибся.',
    'Три вещи никогда не возвращаются обратно — время, слово, возможность.',
    'Главное — верить в себя. Мнение окружающих меняется ежедневно.',
    'Если человек не понимает твои мечты – он не твой человек.'
]
