<template>
    <v-layout class="pane scroller" :class="`theme--${$vuetify.theme.dark ? 'dark' : 'light'}`">
        <v-container class="pane__topic" :class="{ fullscreen, mobile }">
            <h2 class="pane__topic-title mb-5">Раздел справки, общий для всех виджетов.</h2>

            <p class="pane__topic-definition">
                Все модули виджетов предоставляют интерфейс пользовательского ввода данных и конфигурирования,
                встраиваимого в страницу группы пользователя, информационного блока. Такой блок повышает
                информативность, интерактивность и узнаваемость вашей бизнес странички. Безусловно это отражается
                на конверсии лидов и как следствие на рекламном бюджете и стоимости целевого действия.
            </p>

            <v-img class="pane__images image-01 right" @click="view(0)" :src="images[0]" />

            <p class="pane__topic-disclosure">
                Все виджеты имеют некоторый общий функционал, который и будет освещен в данном разделе справки и
                рассмотрен на примере виджета "Плитки". Модуль каждого виджета, можно условно разделить на три блока:
            </p>

            <ul class="features-list with-marks">
                <li>шапка (header) с набором инструментов</li>
                <li>контентная часть</li>
                <li>нижний блок инструментов</li>
            </ul>

            <p class="pane__topic-disclosure">
                В хедере модуля в его левой части отображается название виджета, в правой, располагается набор
                кнопок инструментария, в целом характерного для каждого блока, но также возможны кнопки
                индивидуальные для данного блока. Рассмотрим их по порядку, слева направо. Кнопка сохранить
                <v-icon dense>mdi-content-save</v-icon>, выполняет ожидаемое действие, а именно, сохраняет
                сконструированный виджет. При клике на данную кнопку, вызывается всплывающее окно, где можно
                ввести осмысленное название для виджета. Кнопка сброс <v-icon dense>mdi-sync</v-icon>, очищает
                виджет от пользовательского ввода и приводит виджет в первоначальное состояние. Действие
                происходит без вызова дополнительных меню. Кнопка переключение режима отображения или изменения
                размера элементов виджета <v-icon dense>mdi-resize</v-icon>, характерна для виджетов "Карточки"
                и "Плитки". В первом случае она меняет расположение опциональной кнопки в контентной части, во
                втором случае - изменяет размер плиток с 480х480 на 480х720. Как и предыдущая кнопка, выполнение
                действия, осуществляется без вызова дополнительных меню. Кнопка персонализации по половому признаку
                <v-icon dense>mdi-human-male</v-icon>, позволяет сегментировать контент показываемый
                пользователям в зависимости от половой принадлежности. Кнопка персонализации по языковому
                признаку <widget-ru-icon fill="#999" />, аналогично предыдущему инструменту, позволяет
                произвести сегментацию контента на русскоязычную аудиторию и аудиторию, язык которой,
                указанный в настройках ВК, отличен от русского. Например, в таком случае, можно показывать
                контент на английском языке. И наконец, кнопка настройки <v-icon dense>mdi-cog</v-icon>.
                Графическое отображение инструмента в виде шестеренки находится на стадии обсуждения,
                предположительно наиболее подходящая иконка для данного инструмента - фильтр
                <v-icon dense>mdi-filter-outline</v-icon>, так как наиболее ближе отображает
                назначение инструмента, для большинства модулей виджетов. В основном, за этой кнопкой
                скрывается фильтр категорий пользователей, для которых будет виден данный виджет. И только
                для модуля "Пожертвования", данный инструмен содержит расширенное меню, в котором на ряду
                с фильтром, присутствует вкладка "Баланс", а также вкладка счетов для выплат.
            </p>

            <v-layout class="pane__images justify-flex pc3" column>
                <v-img class="image-02" @click="view(1)" :src="images[1]" />
                <v-img class="image-03" @click="view(2)" :src="images[2]" />
                <v-img class="image-04" @click="view(3)" :src="images[3]" />
            </v-layout>

            <p class="pane__topic-disclosure">
                Контентная часть каждого модуля состоит из двух, общих для всех, блоков: поле ввода заголовка
                и футер виджета, а так же, индивидульного для каждого типа виджета, основного блока, содержание
                которого рассматривается в соответствующих разделах справки. Инструменты нижнего блока, также
                общие для всех типов:
            </p>

            <ul class="features-list">
                <li>
                    <v-icon dense>mdi-menu</v-icon> Меню, содержит три вкладки - список сохраненных виджетов,
                    список шаблонов и настройки. Настройки представлены двумя селектами - выбор группы в которую
                    будет устанавливаться виджет и выбор типа виджета. А так же три кнопки. ПРЕВЬЮ - предварительный
                    просмотр устанавливаемого виджета, доступно при запуске приложения на платформе ВК в качестве
                    VK Mini Apps. ОБНОВИТЬ - устанавливает новый виджет в группу или обновляет существующий.
                    УДАЛИТЬ - соответственно удаляет виджет из группы.
                </li>
                <li>
                    <v-icon dense>mdi-plus</v-icon> Подключить, подключает сервис к сообществу, требуется переход в ВК
                </li>
                <li>
                    <v-icon dense>mdi-code-tags</v-icon> Код, открывает редактор кода для просмотра и ручного
                    редактирования кода виджета. Внимание: используйте данный инструмент только если вы знаете и понимаете
                    что делаете, т.к. для ручного кодирования требуется знание ЯП javascript и API ВК.
                </li>
            </ul>

            <div class="clearfix" />

            <p class="pane__topic-closing">
                Справочное руководство может быть обновлено, уточнено и дополнено.
            </p>
        </v-container>
    </v-layout>
</template>

<script>
    import { help } from '~/mixins/common'

    export default {
        mixins: [help],

        props: {
            fullscreen: {
                type: Boolean,
                required: true
            }
        },
        computed: {
            mobile() {
                return !!(this.$BROWSER || {}).IS_MOBILE
            }
        },
        watch: {
            fullscreen() {
                this.smooth.scrollTo(null, 0)
            }
        },
        data: () => ({
            images: [
                '/img/help/widget.png',
                '/img/help/widget-common-01.png',
                '/img/help/widget-common-03.png',
                '/img/help/widget-common-04.png'
            ]
        }),
        methods: {
            view(idx)
            {
                this.$bus.$emit('view', { idx, frame: this.images.map(url => ({ url, src: url })), edit: false })
            }
        }
    }
</script>

<style lang="scss" scoped>
    .pane.scroller {
        .container.pane__topic {
            .features-list {
                display: flow-root;
                padding-bottom: 16px;

                & > li {
                    padding: 5px;

                    .v-icon {
                        margin-right: 5px;
                    }
                }
                &:not(.with-marks) {
                    & > li {
                        list-style-type: none;
                    }
                }
            }
            .pane__topic-disclosure svg {
                vertical-align: middle;
            }
            .pane__topic-closing {
                margin: 16px auto;
                text-align: center;
            }
            h2 {
                color: #006dad;
            }
        }
        &.theme--dark {
            .container h2 {
                color: hsla(0,0%,100%,.7);
            }
        }
    }
</style>
